//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Область ПрограммныйИнтерфейс

#Область ЖурналРегистрации

// Записывает ошибку (уровень УровеньЖурналаРегистрации.Ошибка) в журнал регистрации
// для события 'Отправка GET запроса'
// 
// Параметры:
//  Текст - Строка - Текст сообщения
Процедура ЗаписьЖурналаРегистрацииОшибкаGetЗапроса(Текст) Экспорт

	ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка GET запроса'"), УровеньЖурналаРегистрации.Ошибка, , , Текст);

КонецПроцедуры

// Записывает ошибку (уровень УровеньЖурналаРегистрации.Ошибка) в журнал регистрации
// 
// Параметры:
//  ИмяСобытия - Строка - Имя события
//  Текст - Строка - Текст сообщения
Процедура ЗаписьЖурналаРегистрацииОшибка(ИмяСобытия, Текст) Экспорт

	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Текст);

КонецПроцедуры

// Записывает информацию (уровень УровеньЖурналаРегистрации.Информация) в журнал регистрации
// 
// Параметры:
//  ИмяСобытия - Строка - Имя события
//  Текст - Строка - Текст сообщения
Процедура ЗаписьЖурналаРегистрацииИнформация(ИмяСобытия, Текст) Экспорт

	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , , Текст);

КонецПроцедуры

#КонецОбласти

#КонецОбласти