//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Область ПрограммныйИнтерфейс

Функция ПубликуемыеДопРеквизиты() Экспорт

	// Считывание настроек из хранилища
	ИмяПодсистемы = Метаданные.Подсистемы.МП_Маркетплейсы.Имя;
	КлючНастроек = СтрШаблон("%1ПубликуемыеДопРеквизиты", ИмяПодсистемы);

	УстановитьПривилегированныйРежим(Истина);

	ПубликуемыеДопРеквизиты = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяПодсистемы,
																			   КлючНастроек,
																			   ,
																			   ,
																			   "ТрубинРВ");

	Если ПубликуемыеДопРеквизиты = Неопределено Тогда

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Родитель",
								  Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоНаименованию("Номенклатура",
																										  Истина));
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
					   |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство КАК Свойство,
					   |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство.Имя КАК Имя
					   |ИЗ
					   |	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК
					   |		НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
					   |ГДЕ
					   |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка В ИЕРАРХИИ (&Родитель)
					   |
					   |УПОРЯДОЧИТЬ ПО
					   |	Имя";

		ПубликуемыеДопРеквизиты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Свойство");

		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяПодсистемы,
														 КлючНастроек,
														 ПубликуемыеДопРеквизиты,
														 ,
														 "ТрубинРВ");

	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);

	Возврат ПубликуемыеДопРеквизиты;

КонецФункции

Функция КонтактныеДанныеСкладов() Экспорт

	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
				   |	СкладыКонтактнаяИнформация.Тип КАК Тип,
				   |	СкладыКонтактнаяИнформация.Представление КАК Представление,
				   |	СкладыКонтактнаяИнформация.Ссылка КАК Склад,
				   |	СкладыКонтактнаяИнформация.Город
				   |ИЗ
				   |	Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформация
				   |ГДЕ
				   |	СкладыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)";

	КонтактныеДанныеСкладов = Запрос.Выполнить().Выгрузить();

	Возврат КонтактныеДанныеСкладов

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти