//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для передачи в параметрах вспомогательных методов (см. ниже).
//       Соответствует 1 параметру процедуры ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки этого отчета,
//       уже сформированные при помощи функции ВариантыОтчетов.ОписаниеОтчета() и готовые к изменению.
//       См. "Свойства для изменения" процедуры ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//    НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//    ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь);
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт

	ПодсистемаAvito = Метаданные.НайтиПоПолномуИмени("Подсистема.МП_Маркетплейсы.Подсистема.Авито");
		
	НастройкиОтчета.Включен = Истина;

	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru= 'Размещение объявлений о продаже товаров на
									 |торговой площадке Авито (первый вариант).'");
	ОписаниеВарианта.Размещение.Вставить(ПодсистемаAvito, "Важный");
	ОписаниеВарианта.Включен = Истина;
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;

//	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, Метаданные.Отчеты.МП_Avito, Истина);

КонецПроцедуры

#КонецОбласти

#КонецЕсли