//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.СтраницаАвито.Видимость = ПоказыватьОбъявлениеССайта;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)

	Запись.Идентификатор = "";

КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьОбъявлениеССайтаПриИзменении(Элемент)
	Элементы.СтраницаАвито.Видимость = ПоказыватьОбъявлениеССайта;
КонецПроцедуры

#КонецОбласти