//
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ПрограммныйИнтерфейс

// Возвращает идентификатор приложения Беру
// 
// Возвращаемое значение:
//  Строка - Идентификатор приложения
Функция ИдентификаторПриложения() Экспорт
	
	Возврат "b8afc2adb33c49259ec993fe4f48008c";
	
КонецФункции

// Возвращает ссылку на портал регистрации
// 
// Возвращаемое значение:
//  Строка - Url регистрации
Функция urlРегистрации() Экспорт
	
	Возврат "https://oauth.yandex.ru/authorize?response_type=token&client_id=" + ИдентификаторПриложения();
	
КонецФункции

Функция ПараметрыИРеквизиты() Экспорт
	
	ПараметрыИРеквизиты = Новый Соответствие();
	ПараметрыИРеквизиты.Вставить("СтранаПроизводителя", "Страна производства");
	ПараметрыИРеквизиты.Вставить("Производитель", "Изготовитель");
	ПараметрыИРеквизиты.Вставить("Марка", "Торговая марка");
	ПараметрыИРеквизиты.Вставить("СрокГодности", "Срок годности");
	ПараметрыИРеквизиты.Вставить("СрокСлужбы", "Срок службы");
	ПараметрыИРеквизиты.Вставить("ГарантийныйСрок", "Гарантийный срок");
	ПараметрыИРеквизиты.Вставить("ShopSku", "Ваш SKU");
	ПараметрыИРеквизиты.Вставить("Вес", "Вес в кг с учётом упаковки");
	ПараметрыИРеквизиты.Вставить("Длина", "Длина в см с учётом упаковки");
	ПараметрыИРеквизиты.Вставить("Ширина", "Ширина в см с учётом упаковки");
	ПараметрыИРеквизиты.Вставить("Высота", "Высота в см с учётом упаковки");
	
	Возврат ПараметрыИРеквизиты;

КонецФункции

#КонецОбласти