#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СостояниеЗаказа(Ссылка) Экспорт

	СостояниеЗаказа = Неопределено;

	ЗаписьВРегистр = РегистрыСведений.СостоянияЗаказовКлиентов.СоздатьМенеджерЗаписи();
	ЗаписьВРегистр.Заказ = Ссылка;
	ЗаписьВРегистр.Прочитать();

	Если ЗначениеЗаполнено(ЗаписьВРегистр.Состояние) Тогда

		СостояниеЗаказа = РегистрыСведений.СостоянияЗаказовКлиентов.Реквизиты();
		ЗаполнитьЗначенияСвойств(СостояниеЗаказа, ЗаписьВРегистр);

	КонецЕсли;

	Возврат СостояниеЗаказа;

КонецФункции

#КонецОбласти

#КонецЕсли