//
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ПрограммныйИнтерфейс

// Отправить GETЗапрос.
// 
// Параметры:
//  URL - Строка - URL
//  Заголовки - Соответствие - Заголовки
// 
// Возвращаемое значение:
//  Структура, Неопределено - Отправить GETЗапрос:
// * КодСостояния - Число -
// * ТелоОтвета - Произвольный -
Функция ОтправитьGETЗапрос(URL, Заголовки = Неопределено) Экспорт

	РезультатВыполненияЗапроса = Неопределено;

	Если Заголовки = Неопределено Тогда
		Заголовки = Новый Соответствие;
	КонецЕсли;

	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(URL);
	HTTPСоединение = Новый HTTPСоединение(СтруктураURI.Хост,
										  СтруктураURI.Порт,
										  ,
										  ,
										  ,
										  10,
										  Новый ЗащищенноеСоединениеOpenSSL(Неопределено,
																			Новый СертификатыУдостоверяющихЦентровОС));
	HTTPЗапрос = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере, Заголовки);

	Попытка
		HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод("GET", HTTPЗапрос);

		Если HTTPОтвет.КодСостояния = 200 Тогда

			ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();

			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТелоОтвета);

			ОтветСайта = ПрочитатьJSON(ЧтениеJSON);

			РезультатВыполненияЗапроса = Новый Структура("КодСостояния, ТелоОтвета", HTTPОтвет.КодСостояния, ОтветСайта);

		КонецЕсли;

	Исключение

		ПодробноеПредставлениеОшибки = ИнформацияОбОшибке();
		МП_ОбщийМодульВызовСервера.ЗаписьЖурналаРегистрацииОшибкаGetЗапроса(ПодробноеПредставлениеОшибки.Описание);

	КонецПопытки;

	Возврат РезультатВыполненияЗапроса;

КонецФункции

#КонецОбласти