// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Параметры.КлючМодели) Тогда
		
		ЭтотОбъект.Заголовок = СтрШаблон("%1 - места использования", Строка(Параметры.КлючМодели));
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																				"КлючМодели",
																				Параметры.КлючМодели,
																				ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти