#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьВидимостьЭлементов();
	УстановитьОтборыСписка();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МаркаПриИзменении(Элемент)

	УстановитьВидимостьЭлементов();
	УстановитьОтборыСписка();

КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)

	УстановитьВидимостьЭлементов();
	УстановитьОтборыСписка();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()

	Если Модель <> ПредопределенноеЗначение("Справочник.АСМ_Модели.ПустаяСсылка") Тогда

		Элементы.Наименование.Видимость = Ложь;
		Элементы.БезМарки.Видимость = Ложь;
		Элементы.БезМаркиБезМодели.Видимость = Истина;

	ИначеЕсли Марка <> ПредопределенноеЗначение("Справочник.АСМ_Марки.ПустаяСсылка") Тогда

		Элементы.Наименование.Видимость = Ложь;
		Элементы.БезМарки.Видимость = Истина;
		Элементы.БезМаркиБезМодели.Видимость = Ложь;

	Иначе

		Элементы.Наименование.Видимость = Истина;
		Элементы.БезМарки.Видимость = Ложь;
		Элементы.БезМаркиБезМодели.Видимость = Ложь;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборыСписка()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Марка",
																			Марка,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(Марка));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Модель",
																			Модель,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(Модель));
КонецПроцедуры

#КонецОбласти