//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Возврат;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МаркаПриИзменении(Элемент)
	ОчиститьЗависимыеТаблицы();
КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	
	МодельПриИзмененииНаСервере();
	
	ОчиститьЗависимыеТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура СЗПоколенияПриИзменении(Элемент)
	СЗПоколенияПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СЗПоколенияПриИзмененииНаСервере()

	Поколения = Новый Массив;

	Для Каждого Эл Из СЗПоколения Цикл
		Если Эл.Пометка Тогда
			Поколения.Добавить(Эл.Значение);
		КонецЕсли;
	КонецЦикла;

	ОпцииОтбора = Справочники.АСМ_Поколения.ОпцииОтбора(Поколения);

	ТЗАгрегаты.Загрузить(ОпцииОтбора.ДвигателиТрансмиссии);
	ТЗКузова.Загрузить(ОпцииОтбора.ТипыКузовов);
	ТЗКомплектации.Загрузить(ОпцииОтбора.Комплектации);

	СЗКузова.Очистить();
	Для Каждого Эл Из ОпцииОтбора.ТипыКузовов Цикл
		СЗКузова.Добавить(Эл.ТипКузова, Эл.Расшифровка, Истина);
	КонецЦикла;

	СЗАгрегаты.Очистить();
	Для Каждого Эл Из ОпцииОтбора.ДвигателиТрансмиссии Цикл
		СЗАгрегаты.Добавить(Эл.Расшифровка, Эл.Расшифровка, Истина);
	КонецЦикла;

	СЗКомплектации.Очистить();
	Для Каждого Эл Из ОпцииОтбора.Комплектации Цикл
		СЗКомплектации.Добавить(Эл.Наименование, Эл.Наименование, Истина);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура МодельПриИзмененииНаСервере()

	Поколения = Справочники.АСМ_Модели.Поколения(Модель);

	СЗПоколения.ЗагрузитьЗначения(Поколения);

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗависимыеТаблицы()
	СЗАгрегаты.Очистить();
	СЗКузова.Очистить();
	СЗКомплектации.Очистить();
КонецПроцедуры



#КонецОбласти