//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитКод = "Код";
	РеквизитТег = "Тег";
	
	
	НаборОбъектов = Новый Массив();
	
	ДобавитьНеПустые(Категория, НаборОбъектов);
	ДобавитьНеПустые(Подкатегория, НаборОбъектов);
	ДобавитьНеПустые(ТипДетали, НаборОбъектов);
	ДобавитьНеПустые(ГруппаДеталей, НаборОбъектов);
	ДобавитьНеПустые(НазваниеДетали, НаборОбъектов);
	
	Коды = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(НаборОбъектов, РеквизитКод);
	Тег = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подкатегория, РеквизитТег);
	
	КодыРазмещения = "";
	
	Для Каждого Элемент Из Коды Цикл
		КодыРазмещения = КодыРазмещения + Элемент.Значение + " ";
	КонецЦикла;
	
	КодыРазмещения = КодыРазмещения + Тег;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

	Процедура ДобавитьНеПустые(Ссылка, Массив)
		
		Если Не Ссылка.Пустая() Тогда
			Массив.Добавить(Ссылка);
		КонецЕсли;
		
	КонецПроцедуры
#КонецОбласти

#КонецЕсли
