//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Область ПрограммнайИнтерфейс

// Определяет соответствие имен параметров сеанса и обработчиков для их установки.
&После("ПриДобавленииОбработчиковУстановкиПараметровСеанса")
Процедура МП_ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт

	Обработчики.Вставить(Метаданные.ПараметрыСеанса.МП_ПВХ_МаркиМодели.Имя,
						 "МП_ОбщегоНазначенияВызовСервера.УстановкаПараметровСеансаПВХ_МаркиМодели");

КонецПроцедуры

#КонецОбласти