//
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ПрограммныйИнтерфейс

// Сохраняет документ DOM в файле.
// 
// Параметры:
//  ДокументDOM - ДокументDOM - Документ DOM
//  ИмяФайлаВыгрузки - Строка - Полное имя файла выгрузки
//  ПространствоИмен - Строка - Пространство имен
Процедура СохранитьДокументDOMВФайле(ДокументDOM, ИмяФайлаВыгрузки, ПространствоИмен) Экспорт

	Файл = Новый ЗаписьXML;
	Файл.ОткрытьФайл(ИмяФайлаВыгрузки, "UTF-8");

	ФайлDOM = Новый ЗаписьDOM;
	ФайлDOM.Записать(ДокументDOM, Файл);

	Файл.Закрыть();

	УдалитьПространствоИмен(ИмяФайлаВыгрузки, ПространствоИмен);

КонецПроцедуры

Функция КоллекцияИзображенийDOM(Запрос,
								Номенклатура,
								ДокументDOM,
								URLЗагрузки,
								ИмяКоллекции,
								ИмяЭлемента,
								URLКакАтрибут = Ложь) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	КоллекцияИзображений = ДокументDOM.СоздатьЭлемент(ИмяКоллекции);

	Запрос.УстановитьПараметр("ВладелецФайла", Номенклатура);
	НаборИзображений = Запрос.Выполнить().Выбрать();

	Пока НаборИзображений.Следующий() Цикл

		URLИзображения = URLЗагрузки + НаборИзображений.ПутьКФайлу;

		Изображение = ДокументDOM.СоздатьЭлемент(ИмяЭлемента);

		Если URLКакАтрибут Тогда
			Изображение.УстановитьАтрибут("url", URLИзображения);
		Иначе
			Изображение.ТекстовоеСодержимое = URLИзображения;
		КонецЕсли;

		КоллекцияИзображений.ДобавитьДочерний(Изображение);

	КонецЦикла;

	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат КоллекцияИзображений;

КонецФункции

// Проверяет дополнительный реквизит по имени допустимость публикации в объявлении
// 
// Параметры:
//  Имя - Строка - Имя дополнительного реквизита
// 
// Возвращаемое значение:
//  Булево - Истина - публиковать
Функция ДРПодлежитПубликации(Имя) Экспорт

	Возврат Не СтрНачинаетсяС(Имя, "ДРН_")
			И Не СтрНачинаетсяС(Имя, "СДР_")
			И Не СтрНачинаетсяС(Имя, "ДР_МаркиМодели")
			И Не СтрНачинаетсяС(Имя, "ДР_Автопитер")
			И Не СтрНачинаетсяС(Имя, "ДР_VideoURL")
			И Не СтрНачинаетсяС(Имя, "ДР_Примечания");
КонецФункции

// Удаляет пространство имен из файла
//
// Параметры:
//   ИмяФайла - Строка - путь к файлу на диске
//   ПространствоИмен - Строка - удаляемое пространство имен.
//
Процедура УдалитьПространствоИмен(ИмяФайла, ПространствоИмен) Экспорт

	Текст = Новый ТекстовыйДокумент;
	Текст.Прочитать(ИмяФайла, "windows-1251");
	СтрокаФайл = Текст.ПолучитьСтроку(2);
	СтрокаФайл = СтрЗаменить(СтрокаФайл, "xmlns=""" + ПространствоИмен + """", "");
	Текст.ЗаменитьСтроку(2, СтрокаФайл);
	Текст.Записать(ИмяФайла, "windows-1251");

КонецПроцедуры

#КонецОбласти