&НаКлиенте
Процедура Загомырить(Команда)
	ЗагомыритьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагомыритьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	МП_АвитоИдентификаторыОбъявлений.Номенклатура,
				   |	МП_АвитоИдентификаторыОбъявлений.Характеристика,
				   |	МП_АвитоИдентификаторыОбъявлений.Профиль,
				   |	МП_АвитоИдентификаторыОбъявлений.ИдентификаторАвито,
				   |	МП_АвитоИдентификаторыОбъявлений.АйДи,
				   |	МП_АвитоИдентификаторыОбъявлений.НазваниеОбъявления,
				   |	МП_АвитоИдентификаторыОбъявлений.ДатаНачала,
				   |	МП_АвитоИдентификаторыОбъявлений.ДатаОкончания,
				   |	МП_АвитоИдентификаторыОбъявлений.ВариантПлатногоРазмещения,
				   |	МП_АвитоИдентификаторыОбъявлений.ПлатнаяУслуга,
				   |	МП_АвитоИдентификаторыОбъявлений.ВозможностьНаписатьСообщениеПоОбъявлениюЧерезСайт,
				   |	МП_АвитоИдентификаторыОбъявлений.Менеджер,
				   |	МП_АвитоИдентификаторыОбъявлений.НомерТелефона,
				   |	МП_АвитоИдентификаторыОбъявлений.Адрес,
				   |	МП_АвитоИдентификаторыОбъявлений.КатегорияОбъявления,
				   |	МП_АвитоИдентификаторыОбъявлений.ПодкатегорияТовара,
				   |	МП_АвитоИдентификаторыОбъявлений.ВидОбъявления,
				   |	МП_АвитоИдентификаторыОбъявлений.Состояние,
				   |	МП_АвитоИдентификаторыОбъявлений.Доступность,
				   |	МП_АвитоИдентификаторыОбъявлений.OEM,
				   |	МП_АвитоИдентификаторыОбъявлений.СтатусОбъявления,
				   |	МП_АвитоИдентификаторыОбъявлений.URLАдресОбъявления,
				   |	МП_АвитоИдентификаторыОбъявлений.Идентификатор,
				   |	МП_АвитоИдентификаторыОбъявлений.СтатусРазмещенияНаСайте,
				   |	МП_АвитоИдентификаторыОбъявлений.ОбщийСтатусОбработкиОбъявления,
				   |	МП_АвитоИдентификаторыОбъявлений.СтатусПредварительнойОбработки
				   |ИЗ
				   |	РегистрСведений.УдалитьМП_АвитоИдентификаторыОбъявлений КАК МП_АвитоИдентификаторыОбъявлений";

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяЗапись = РегистрыСведений.УдалитьМП_АвитоОбъявления.СоздатьМенеджерЗаписи();
		НоваяЗапись.Заполнить(Неопределено);
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры