//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НовыйОбъект = Параметры.Ключ.Пустая();

	Если НовыйОбъект Тогда

		ОпцииСоздания = Параметры.ПараметрыВыбора;

		Если ТипЗнч(ОпцииСоздания) = Тип("Структура") Тогда
			ОпцииСоздания.Свойство("Марка", Объект.Марка);
			ОпцииСоздания.Свойство("Модель", Объект.Модель);
		КонецЕсли;

	Иначе

		ОпцииОтбора = Справочники.АСМ_Модели.ОпцииОтбора(Объект.Модель);
		СписокПоколения.ЗагрузитьЗначения(ОпцииОтбора.Поколения.ВыгрузитьКолонку("Поколение"));

	КонецЕсли;

	Если Объект.Комплектации.Количество() > 0 Тогда

		ВыбранныеОпции = Справочники.АСМ_КлючиМоделей.ВыбранныеОпции(Объект.Ссылка);

		УстановитьПометкиСписка(ВыбранныеОпции.Поколения, СписокПоколения, "Поколение");
//		Для Каждого Эл Из ВыбранныеОпции.Поколения Цикл
//			НайденЭлемент = СписокПоколения.НайтиПоЗначению(Эл.Поколение);
//			Если НайденЭлемент <> Неопределено Тогда
//				НайденЭлемент.Пометка = Истина;
//			КонецЕсли;
//		КонецЦикла;

		ОбновитьСпискиПоПоколению(Ложь);

		УстановитьПометкиСписка(ВыбранныеОпции.ТипыКузовов, СписокКузова, "Расшифровка");
		УстановитьПометкиСписка(ВыбранныеОпции.Комплектации, СписокКомплектации, "Наименование");
		УстановитьПометкиСписка(ВыбранныеОпции.Агрегаты, СписокАгрегаты, "Расшифровка");

	ИначеЕсли ЗначениеЗаполнено(Объект.Марка) И ЗначениеЗаполнено(Объект.Модель) Тогда

		Поколения = МодельПриИзмененииНаСервере(Объект.Модель);
		СписокПоколения.ЗагрузитьЗначения(Поколения);
		ОбновитьСпискиПоПоколению(Ложь);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ВключатьИмяПоколенийВКлюч = ПолучитьФункциональнуюОпцию("АСМ_ВключатьНаименованияПоколенийВИмяКлюча");

	ТекущийГод = Формат(Год(ТекущаяДатаСеанса()), "ЧГ=0;");	//TODO: перевести на параметр сеанса
	ГодНП = ТекущийГод;
	ГодОП = "1800";

	ТекущийОбъект.Комплектации.Очистить();
	НаборКодов = Новый Массив;

	СписокКузоваВыбрано = ВыбранныеВСписке(СписокКузова);
	СписокКомплектацииВыбрано = ВыбранныеВСписке(СписокКомплектации);
	СписокПоколенияВыбрано = ВыбранныеВСписке(СписокПоколения);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Марка", ТекущийОбъект.Марка);
	Запрос.УстановитьПараметр("Модель", ТекущийОбъект.Модель);
	Запрос.УстановитьПараметр("Комплектации", СписокКомплектацииВыбрано);
	Запрос.УстановитьПараметр("ТипКузова", СписокКузоваВыбрано);
	Запрос.УстановитьПараметр("Поколения", СписокПоколенияВыбрано);

	Запрос.Текст = "ВЫБРАТЬ
				   |	АСМ_МодификацииКомплектации.Комплектация КАК Комплектация,
				   |	АСМ_МодификацииКомплектации.Комплектация.Код КАК КомплектацияКод,
				   |	АСМ_МодификацииКомплектации.Ссылка.ГодНачалаВыпуска.Наименование КАК ГодНачалаВыпуска,
				   |	АСМ_МодификацииКомплектации.Ссылка.ГодОкончанияВыпуска.Наименование КАК ГодОкончанияВыпуска
				   |ИЗ
				   |	Справочник.АСМ_Модификации.Комплектации КАК АСМ_МодификацииКомплектации
				   |ГДЕ
				   |	АСМ_МодификацииКомплектации.Комплектация.Наименование В (&Комплектации)
				   |	И АСМ_МодификацииКомплектации.Ссылка.Марка = &Марка
				   |	И АСМ_МодификацииКомплектации.Ссылка.Модель = &Модель
				   |	И АСМ_МодификацииКомплектации.Ссылка.ТипТоплива = &ТипТоплива
				   |	И АСМ_МодификацииКомплектации.Ссылка.ТипПривода = &ТипПривода
				   |	И АСМ_МодификацииКомплектации.Ссылка.ТипТрансмиссии = &ТипТрансмиссии
				   |	И АСМ_МодификацииКомплектации.Ссылка.Мощность = &Мощность
				   |	И АСМ_МодификацииКомплектации.Ссылка.РабочийОбъем = &РабочийОбъем
				   |	И АСМ_МодификацииКомплектации.Ссылка.ТипКузова.Наименование + "" ("" +
				   |		АСМ_МодификацииКомплектации.Ссылка.КоличествоДверей.Наименование + "" дв.)"" В (&ТипКузова)
				   |	И АСМ_МодификацииКомплектации.Ссылка.Поколение В (&Поколения)";

	СтрокиТЗ = ТаблицаАгрегаты.НайтиСтроки(Новый Структура("Совместимо", Истина));

	Для Каждого Эл Из СтрокиТЗ Цикл

		Запрос.УстановитьПараметр("ТипТоплива", Эл.ТипТоплива);
		Запрос.УстановитьПараметр("ТипПривода", Эл.ТипПривода);
		Запрос.УстановитьПараметр("ТипТрансмиссии", Эл.ТипТрансмиссии);
		Запрос.УстановитьПараметр("Мощность", Эл.Мощность);
		Запрос.УстановитьПараметр("РабочийОбъем", Эл.РабочийОбъем);

		Выборка = Запрос.Выполнить().Выбрать();

		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТекущийОбъект.Комплектации.Добавить();
			НоваяСтрока.Комплектация = Выборка.Комплектация;
			НаборКодов.Добавить(Выборка.КомплектацияКод);
			
			// Корректировка годов начала и окончания выпуска
			Если Выборка.ГодНачалаВыпуска < ГодНП Тогда
				ГодНП = Выборка.ГодНачалаВыпуска;
			КонецЕсли;

			Если Выборка.ГодОкончанияВыпуска > ГодОП Тогда
				ГодОП = Выборка.ГодОкончанияВыпуска;
			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	ТекущийОбъект.Описание = СтрСоединить(НаборКодов, " ");
	
	// Формирование строки поколений
	ПоколенияСтрока = СтрШаблон("%1-%2", ГодНП, ГодОП);

	Если ВключатьИмяПоколенийВКлюч И СписокПоколенияВыбрано.Количество() > 0 Тогда

		ПоколенияСтрока = ПоколенияСтрока + " (";
		ЭтоНеПервоеВхождение = Ложь;

		Для Каждого Пок Из СписокПоколенияВыбрано Цикл
			
			// Удаление годов выпуска из наименования поколения
			Поколение = СокрЛП(Строка(Пок));
			ИндексСкобки = СтрНайти(Поколение, "(", НаправлениеПоиска.СКонца);
			Если ИндексСкобки > 1 Тогда
				Поколение = СокрП(Лев(Поколение, ИндексСкобки - 1));
			КонецЕсли;
			
			// Занесение наименования поколения в строку ПоколенияСтрока
			Если ЭтоНеПервоеВхождение Тогда
				ПоколенияСтрока = ПоколенияСтрока + ", " + Поколение;
			Иначе
				ЭтоНеПервоеВхождение = Истина;
				ПоколенияСтрока = ПоколенияСтрока + Поколение;
			КонецЕсли;

		КонецЦикла;

		ПоколенияСтрока = ПоколенияСтрока + ")";

	КонецЕсли;

	// Добавление строки КузоваСтрока
	ВыбраноКузовов = СписокКузоваВыбрано.Количество();
	НеВсеКузова = (ВыбраноКузовов < СписокКузова.Количество());

	Если НеВсеКузова Тогда

		Если ВыбраноКузовов = 1 Тогда
			КузоваСтрока = СписокКузоваВыбрано[0];
		ИначеЕсли ВыбраноКузовов = 2 Тогда
			КузоваСтрока = СписокКузоваВыбрано[0] + ", " + СписокКузоваВыбрано[1];
		Иначе
			КузоваСтрока = СтрШаблон("%1+%2", СписокКузоваВыбрано[0], ВыбраноКузовов - 1);
		КонецЕсли;

		ПоколенияСтрока = ПоколенияСтрока + " " + КузоваСтрока;
	КонецЕсли;
	
	// Добавление строки КомплектацииСтрока
	ВыбраноКомплектаций = СписокКомплектацииВыбрано.Количество();
	НеВсеКомплектации = (ВыбраноКомплектаций < СписокКомплектации.Количество());

	Если НеВсеКомплектации Тогда

		// Формирование строки КомплектацииСтрока
		Если ВыбраноКомплектаций = 1 Тогда
			КомплектацииСтрока = СписокКомплектацииВыбрано[0];
		ИначеЕсли ВыбраноКузовов = 2 Тогда
			КомплектацииСтрока = СписокКомплектацииВыбрано[0] + ", " + СписокКомплектацииВыбрано[1];
		Иначе
			КомплектацииСтрока = СтрШаблон("%1+%2", СписокКомплектацииВыбрано[0], ВыбраноКомплектаций - 1);
		КонецЕсли;

		Если НеВсеКузова Тогда
			ПоколенияСтрока = ПоколенияСтрока + ";";
		КонецЕсли;

		ПоколенияСтрока = ПоколенияСтрока + " " + КомплектацииСтрока;

	КонецЕсли;
	
	// Установка реквизитов
	ТекущийОбъект.Наименование = Строка(ТекущийОбъект.Марка)
								 + " "
								 + Строка(ТекущийОбъект.Модель)
								 + " "
								 + ПоколенияСтрока;
	ТекущийОбъект.БезМарки = Строка(ТекущийОбъект.Модель) + " " + ПоколенияСтрока;
	ТекущийОбъект.БезМаркиБезМодели = ПоколенияСтрока;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МаркаПриИзменении(Элемент)
	ОчиститьЗависимыеТаблицы();
КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)

	ОчиститьЗависимыеТаблицы();

	Поколения = МодельПриИзмененииНаСервере(Объект.Модель);
	СписокПоколения.ЗагрузитьЗначения(Поколения);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПоколения

&НаКлиенте
Процедура СписокПоколенияПриИзменении(Элемент)
	ОбновитьСпискиПоПоколению();
	
	// Формирование наименования
	Наименование = Строка(Объект.Марка) + " " + Строка(Объект.Модель);
	Для Каждого Пок Из СписокПоколения Цикл
		Если Пок.Пометка Тогда
			Наименование = Наименование + " " + Строка(Пок);
		КонецЕсли;
	КонецЦикла;

	Объект.Наименование = Наименование;

КонецПроцедуры

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УстановитьПометкиСписка(Источник, Приемник, ИмяПоля)

	Для Каждого Эл Из Источник Цикл
		НайденЭлемент = Приемник.НайтиПоЗначению(Эл[ИмяПоля]);
		Если НайденЭлемент <> Неопределено Тогда
			НайденЭлемент.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Возвращает массив с выбранными в списке элементами
// 
// Параметры:
//  Список - СписокЗначений - Список
// 
// Возвращаемое значение:
//  Массив - Выбранные в списке
&НаСервереБезКонтекста
Функция ВыбранныеВСписке(Список)

	Результат = Новый Массив;

	Для Каждого Эл Из Список Цикл
		Если Эл.Пометка Тогда
			Результат.Добавить(Эл.Значение);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ОчиститьЗависимыеТаблицы()
	СписокАгрегаты.Очистить();
	СписокКузова.Очистить();
	СписокКомплектации.Очистить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция МодельПриИзмененииНаСервере(Модель)
	Поколения = Справочники.АСМ_Модели.Поколения(Модель);
	Возврат Поколения;
КонецФункции

&НаСервере
Процедура ОбновитьСпискиПоПоколению(Выбрано = Истина)

	Поколения = Новый Массив;

	Для Каждого Эл Из СписокПоколения Цикл
		Если Эл.Пометка Тогда
			Поколения.Добавить(Эл.Значение);
		КонецЕсли;
	КонецЦикла;

	ОпцииОтбора = Справочники.АСМ_Поколения.ОпцииОтбора(Поколения);

	ТаблицаАгрегаты.Загрузить(ОпцииОтбора.Агрегаты);

	СписокКузова.Очистить();
	Для Каждого Эл Из ОпцииОтбора.ТипыКузовов Цикл
		СписокКузова.Добавить(Эл.Расшифровка, Эл.Расшифровка, Выбрано);
	КонецЦикла;

	СписокАгрегаты.Очистить();
	Для Каждого Эл Из ОпцииОтбора.Агрегаты Цикл
		СписокАгрегаты.Добавить(Эл.Расшифровка, Эл.Расшифровка, Выбрано);
	КонецЦикла;

	СписокКомплектации.Очистить();
	Для Каждого Эл Из ОпцииОтбора.Комплектации Цикл
		СписокКомплектации.Добавить(Эл.Наименование, Эл.Наименование, Выбрано);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СписокАгрегатыПометкаПриИзменении(Элемент)

	Индекс = Элементы.СписокАгрегаты.ТекущаяСтрока;

	ТекущееЗначение = Элементы.СписокАгрегаты.ТекущиеДанные.Значение;

	Нечто = ТаблицаАгрегаты.НайтиСтроки(Новый Структура("Расшифровка", ТекущееЗначение));

	Нечто[0].Совместимо = Не Нечто[0].Совместимо;

КонецПроцедуры

#КонецОбласти