//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Возврат;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
Процедура ВидМаркетплейсаПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьТекстовыйЭлемент(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Реквизит = Элемент.Имя;

	ПараметрыОповещения = Новый Структура("Реквизит", Реквизит);

	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтотОбъект, ПараметрыОповещения);
	ПоказатьВводСтроки(Оповещение, Объект[Реквизит], "Изменение шапки объявления",, Истина);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()

	ЯндексМагазин = (Объект.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.МП_ВидыМаркетплейсов.VK")
					 Или Объект.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.МП_ВидыМаркетплейсов.ДРОМ")
					 Или Объект.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.МП_ВидыМаркетплейсов.СберМегаМаркет")
					 Или Объект.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.МП_ВидыМаркетплейсов.Юла")
					 Или Объект.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.МП_ВидыМаркетплейсов.ДубльГис"));

	Элементы.ГруппаАккаунт.Видимость = Не ЯндексМагазин;
	Элементы.ГруппаЗоныПоказа.Видимость = Не ЯндексМагазин;
	Элементы.ГруппаСегментыАвито.Видимость = Не ЯндексМагазин;
//	Элементы.ГруппаКонтакты.Видимость = Не ЯндексМагазин;

	Элементы.ГруппаОписаниеМагазина.Видимость = ЯндексМагазин;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтроки(Строка, Параметры) Экспорт

	Если Строка <> Неопределено Тогда
		Модифицированность = Истина;
		Объект[Параметры.Реквизит] = Строка;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти