// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ПрограммныйИнтерфейс

&После("ОпределитьРазделыСВариантамиОтчетов")
Процедура АС2_ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	Разделы.Добавить(Метаданные.Подсистемы.АвтосервисАвтомагазин, НСтр("ru= 'Отчеты по автосервису'"));
КонецПроцедуры

&После("НастроитьВариантыОтчетов")
Процедура АС2_НастроитьВариантыОтчетов(Настройки) Экспорт
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.АС2_ГрафикСервиса);
КонецПроцедуры

#КонецОбласти