//
//	Филимонов И.В.
//		+7 913 240 81 77

#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Владелец") Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список,
				"Владелец",
				Параметры.Владелец,
				ВидСравненияКомпоновкиДанных.Равно,
				,
				ЗначениеЗаполнено(Параметры.Владелец));
		Элементы.Владелец.Видимость = Не ЗначениеЗаполнено(Параметры.Владелец);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти // Обработчики_событий_формы

#Область Обработчики_событий_элементов_формы

#КонецОбласти // Обработчики_событий_элементов_формы

#Область Обработчики_команд_формы

#КонецОбласти // Обработчики_команд_формы

#Область Программный_интерфейс

#КонецОбласти // Программный_интерфейс

