//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Находит элемент справочника по коду и наименованию.
// 
// Если отсутствует элемент справочника с заданным кодом и ИзменятьЭлемент = Истина - создает новый элемент
// Если наименование не соответствует заданному и ИзменятьЭлемент = Истина - производит переименование элемента
// 
// В случае неудачного поиска, создания или переименования элемента возвращает Неопределено
// 
// Параметры:
//  Код - Строка - Код
//  Наименование - Строка - Наименование
//  ИзменятьЭлемент - Булево - При необходимости изменять наименование или создавать новый элемент
//  СчетчикИзмененных - Число, Неопределено - Счетчик измененных элементов
// 
// Возвращаемое значение:
//  Неопределено, СправочникСсылка.АСМ_Марки - Найденный или созданный элемент
Функция НайтиПоКодуИНаименованию(ДанныеЗаполнения, ИзменятьЭлемент = Ложь, СчетчикИзмененных = Неопределено) Экспорт

	ИмяСобытия = НСтр("ru='КаталогАвтомобилей.ИзменениеЭлементаКаталога'");
	СправочникМенеджер = Справочники.АСМ_Марки;

	Ссылка = АСМ_КаталогВызовСервера.НайтиСоздатьПоКодуИНаименованию(СправочникМенеджер,
																				ДанныеЗаполнения,
																				ИзменятьЭлемент,
																				СчетчикИзмененных);
	Возврат Ссылка;

КонецФункции

#КонецОбласти

#КонецЕсли