//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОткрытьФормуСпискаКлючей(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт

	ПараметрыВызова = Новый Структура("Номенклатура", ПараметрКоманды);

	ОткрытьФорму("Обработка.АСМ_СписокКлючейМоделей.Форма.Форма",
				 ПараметрыВызова,
				 ПараметрыВыполненияКоманды.Форма,
				 ПараметрыВыполненияКоманды.Форма.УникальныйИдентификатор,
				 ,
				 ,
				 ,
				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти