//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Для Каждого Элемент Из ЭтотОбъект Цикл

		МП_АвитоВызовСервера.ЗаполнитьНазваниеОбъявления(Элемент);
		ЗаполнитьИдентификаторОбъявления(Элемент);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьИдентификаторОбъявления(Элемент)

	Профиль = ?(Элемент.Профиль.Пустая(), "БезПрофиля", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Профиль,
																								  "Код"));
	Номенклатура = ?(Элемент.Номенклатура.Пустая(),
					 "БезНоменклатуры",
					 ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Номенклатура, "Код"));
	Характеристика = ?(Элемент.Характеристика.Пустая(),
					   "БезХарактеристики",
					   ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Характеристика, "Наименование"));
	Идентификатор = СтрШаблон("%1$%2$%3", Профиль, Номенклатура, Характеристика);

	Элемент.Идентификатор = Идентификатор;

КонецПроцедуры

#КонецОбласти

#КонецЕсли