
//
//	Филимонов И.В.
//		+7 913 240 81 77
//	
#Область ОписаниеПеременных

&НаКлиенте
Перем АдресСайта;
&НаКлиенте
Перем ШаблонПолучитьТокен;
&НаКлиенте
Перем КлючТокена;
&НаКлиенте
Перем ШаблонПолучитьИнформациюОКлиенте;
&НаКлиенте
Перем ШаблонПолучитьБаланс;
&НаКлиенте
Перем ШаблонПолучитьИнформациюПоОбъявлениям;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Список выбора для СтатусРазмещенияНаСайте
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	МП_АвитоИдентификаторыОбъявлений.СтатусРазмещенияНаСайте КАК Статус
				   |ИЗ
				   |	РегистрСведений.МП_АвитоИдентификаторыОбъявлений КАК МП_АвитоИдентификаторыОбъявлений
				   |УПОРЯДОЧИТЬ ПО
				   |	Статус";
	ТЗНаборСтатусов = Запрос.Выполнить().Выгрузить();
	НаборСтатусов = ТЗНаборСтатусов.ВыгрузитьКолонку("Статус");

	Элементы.СтатусРазмещенияНаСайте1.СписокВыбора.ЗагрузитьЗначения(НаборСтатусов);

	// Список выбора для СтатусРазмещенияНаСайте
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	МП_АвитоИдентификаторыОбъявлений.ОбщийСтатусОбработкиОбъявления КАК Статус
				   |ИЗ
				   |	РегистрСведений.МП_АвитоИдентификаторыОбъявлений КАК МП_АвитоИдентификаторыОбъявлений
				   |УПОРЯДОЧИТЬ ПО
				   |	Статус";
	ТЗНаборСтатусов = Запрос.Выполнить().Выгрузить();
	НаборСтатусов = ТЗНаборСтатусов.ВыгрузитьКолонку("Статус");

	Элементы.ОтборОбщийСтатусОбработкиОбъявления.СписокВыбора.ЗагрузитьЗначения(НаборСтатусов);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЗначениеЗаполнено(Профиль) Тогда
		
		// Заполнение статуса профиля
		ЗаполнитьСтатусыПрофиля();
		УстановитьОтборРавноПоИмени(Элементы.Профиль.Имя);

	КонецЕсли;

	УстановитьОтборРавноПоИмени(Элементы.Менеджер.Имя);
	УстановитьОтборРавноПоИмени(Элементы.СтатусРазмещенияНаСайте.Имя);
	УстановитьОтборРавноПоИмени(Элементы.ОбщийСтатусОбработкиОбъявления.Имя);
	УстановитьОтборПоУправление();

	ПриоритетПоАвито = Истина;

КонецПроцедуры

&НаКлиенте
Процедура УправлениеПриИзменении(Элемент)
	УстановитьОтборПоУправление();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПрофильПриИзменении(Элемент)
	ЗаполнитьСтатусыПрофиля();
	УстановитьОтборРавноПоИмени(Элементы.Профиль.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОтборМенеджерПриИзменении(Элемент)
	УстановитьОтборРавноПоИмени(Элементы.Менеджер.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОтборОбщийСтатусОбработкиОбъявленияПриИзменении(Элемент)
	УстановитьОтборРавноПоИмени(Элементы.ОбщийСтатусОбработкиОбъявления.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусРазмещенияНаСайтеПриИзменении(Элемент)
	УстановитьОтборРавноПоИмени(Элементы.СтатусРазмещенияНаСайте.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьОбъявленияПоАвито(Команда)

	Если ЗначениеЗаполнено(Профиль) Тогда
		ДлительнаяОперация = НачатьОбновлениеОбъявленийПоАвито(УникальныйИдентификатор, Профиль);

		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;

		// Подключение обработчика завершения фонового задания.
		ОбработкаЗавершения = Новый ОписаниеОповещения("ПриЗавершенииОбновленияОбъявленийПоАвито", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОбработкаЗавершения, ПараметрыОжидания);

	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбран профиль'"),, "ОтборПрофиль");
	КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура СформироватьФайлАвтозагрузки(Команда)

	// Параметры ожидания для фоновых обработок
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;

	// Обработка завершения
	ДополнительныеПараметры = Новый Структура("ИмяОбработки", "НачатьФормированиеАвтозагрузки");
	ОбработкаЗавершения = Новый ОписаниеОповещения("ПриЗавершенииФормированиеАвтозагрузки",
												   ЭтотОбъект,
												   ДополнительныеПараметры);
	
	// Удаление передач товаров 
	ДлительнаяОперация = НачатьФормированиеАвтозагрузки(УникальныйИдентификатор, Профиль, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОбработкаЗавершения, ПараметрыОжидания);

//	ПакетАвито = МП_АвитоВызовСервера.СформироватьФайлАвтозагрузкиПрофиля(Профиль);
//
//	ОбщегоНазначенияКлиент.СообщитьПользователю(ПакетАвито);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыОбъявлений(Команда)

	Если ЗначениеЗаполнено(Профиль) Тогда
		ДлительнаяОперация = НачатьОбновлениеСтатусовОбъявлений(УникальныйИдентификатор, Профиль);

		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;

		// Подключение обработчика завершения фонового задания.
		ОбработкаЗавершения = Новый ОписаниеОповещения("ПриЗавершенииОбновленияСтатусовОбъявления", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОбработкаЗавершения, ПараметрыОжидания);

	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбран профиль'"),, "ОтборПрофиль");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборРавноПоИмени(ИмяПоля)

	ПравоеЗначение = ЭтаФорма[ИмяПоля];
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			ИмяПоля,
																			ПравоеЗначение,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(ПравоеЗначение));

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоУправление()

	ИспользоватьОтбор = Не (Управление = "Все" Или ПустаяСтрока(Управление));

	ВидСравненияДляСписка = ?(Управление = "Автозагрузка",
							  ВидСравненияКомпоновкиДанных.Заполнено,
							  ВидСравненияКомпоновкиДанных.НеЗаполнено);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Номенклатура",
																			ОбщийСтатусОбработкиОбъявления,
																			ВидСравненияДляСписка,
																			,
																			ИспользоватьОтбор);
КонецПроцедуры

&НаСервереБезКонтекста
Функция НачатьОбновлениеОбъявленийПоАвито(УникальныйИдентификатор, Профиль)

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
												"МП_АвитоВызовСервера.ОбновитьОбъявленияПрофиля",
												Профиль);
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииОбновленияОбъявленийПоАвито(Результат, ДополнительныеПараметры) Экспорт
	
		// Обновление списка объявлений
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.УдалитьМП_АвитоИдентификаторыОбъявлений"));
	ЗаполнитьСтатусыПрофиля();
		
		// Пользователь отменил задание
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//	// Ошибка выполнения задания
	//	Если Результат.Статус = "Ошибка" Тогда
	////		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	//	КонецЕсли;
	//
	//	// Успешное выполнение обновления
	//	Если Результат.Статус = "Выполнено" Тогда
	//
	//		РезультатОбновления = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	//		
	//		// Вывести результат обновления справочника
	//
	//	КонецЕсли;

КонецПроцедуры

#Область ОбновитьСтатусыОбъявлений

&НаСервереБезКонтекста
Функция НачатьОбновлениеСтатусовОбъявлений(УникальныйИдентификатор, Профиль)

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
												"МП_АвитоВызовСервера.ОбновитьОтчетПоАвтозагрузкеПрофиля",
												Профиль);
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииОбновленияСтатусовОбъявления(Результат, ДополнительныеПараметры) Экспорт
	
		// Обновление списка объявлений
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.УдалитьМП_АвитоИдентификаторыОбъявлений"));
	ЗаполнитьСтатусыПрофиля();
		
		// Пользователь отменил задание
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//	// Ошибка выполнения задания
	//	Если Результат.Статус = "Ошибка" Тогда
	////		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	//	КонецЕсли;
	//
	//	// Успешное выполнение обновления
	//	Если Результат.Статус = "Выполнено" Тогда
	//
	//		РезультатОбновления = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	//		
	//		// Вывести результат обновления справочника
	//
	//	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Процедура ОчиститьСтатусыОбъявлений(Профиль)

	НаборЗаписей = РегистрыСведений.УдалитьМП_АвитоИдентификаторыОбъявлений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Профиль.Установить(Профиль, Истина);
	НаборЗаписей.Прочитать();

	Для Каждого Элемент Из НаборЗаписей Цикл
		Элемент.СтатусОбъявления = "";
	КонецЦикла;

	НаборЗаписей.Записать();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбъединитьСЗаписьюРегистра(Элемент, Профиль, ПриоритетПоАвито = Ложь)

	ПоУмолчанию = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Профиль,
															 "ТелефонПоУмолчанию,АдресПоУмолчанию,ВедущийМенеджер");

	НаборЗаписей = РегистрыСведений.УдалитьМП_АвитоИдентификаторыОбъявлений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторАвито.Установить(Элемент.id, Истина);
	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() > 0 Тогда
		Для Каждого Эл Из НаборЗаписей Цикл

			Если ПриоритетПоАвито Тогда
				Эл.Профиль = Профиль;
				Эл.ВидОбъявления = Перечисления.МП_АвитоВидыОбъявлений.ТоварПриобретенНаПродажу;
				Эл.Состояние = Перечисления.МП_АвитоСостояние.Новое;
				Эл.НазваниеОбъявления = Элемент.title;
				Эл.ВариантПлатногоРазмещения = Перечисления.МП_АвитоВариантыПлатногоРазмещения.Package;
				Эл.ПлатнаяУслуга = Справочники.МП_АвитоПлатныеУслуги.НайтиПоКоду("Free");
				Эл.Адрес = ПоУмолчанию.АдресПоУмолчанию;
				Эл.НомерТелефона = ПоУмолчанию.ТелефонПоУмолчанию;
				Эл.Менеджер = ПоУмолчанию.ВедущийМенеджер;
				Эл.КатегорияОбъявления = "Запчасти и аксессуары";
			КонецЕсли;

			Эл.СтатусОбъявления = Элемент.status;
			Эл.URLАдресОбъявления = Элемент.url;

		КонецЦикла;
	Иначе
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Профиль = Профиль;
		НоваяЗапись.ИдентификаторАвито = Элемент.id;
		НоваяЗапись.НазваниеОбъявления = Элемент.title;
		НоваяЗапись.КатегорияОбъявления = Элемент.category.name;
		НоваяЗапись.СтатусОбъявления = Элемент.status;
		НоваяЗапись.URLАдресОбъявления = Элемент.url;
		НоваяЗапись.Адрес = ПоУмолчанию.АдресПоУмолчанию;
		НоваяЗапись.Менеджер = ПоУмолчанию.ВедущийМенеджер;
		НоваяЗапись.НомерТелефона = ПоУмолчанию.ТелефонПоУмолчанию;
		НоваяЗапись.КатегорияОбъявления = "Запчасти и аксессуары";
		НоваяЗапись.Состояние = Перечисления.МП_АвитоСостояние.Новое;
		НоваяЗапись.ВариантПлатногоРазмещения = Перечисления.МП_АвитоВариантыПлатногоРазмещения.Package;
		НоваяЗапись.ПлатнаяУслуга = Справочники.МП_АвитоПлатныеУслуги.НайтиПоКоду("Free");

		НоваяЗапись.Период = ТекущаяДатаСеанса();
	КонецЕсли;

	НаборЗаписей.Записать(Истина);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусыПрофиля()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.Текст = "ВЫБРАТЬ
				   |	МП_АвитоСтатусыЗагрузокСрезПоследних.НомерОтчета,
				   |	МП_АвитоСтатусыЗагрузокСрезПоследних.ВремяОкончанияВыгрузкиОбъявленийНаСайт,
				   |	МП_АвитоСтатусыЗагрузокСрезПоследних.ВремяСозданияОтчета,
				   |	МП_АвитоСтатусыЗагрузокСрезПоследних.НазваниеОрганизации,
				   |	МП_АвитоСтатусыЗагрузокСрезПоследних.ВремяГенерацииДанногоОтчета,
				   |	МП_АвитоСтатусыЗагрузокСрезПоследних.ОбщийСтатусВыгрузки,
				   |	МП_АвитоСтатусыЗагрузокСрезПоследних.ВерсияФорматаОтчета
				   |ИЗ
				   |	РегистрСведений.МП_АвитоСтатусыЗагрузок.СрезПоследних КАК МП_АвитоСтатусыЗагрузокСрезПоследних
				   |ГДЕ
				   |	МП_АвитоСтатусыЗагрузокСрезПоследних.Профиль = &Профиль";

	Статусы = Запрос.Выполнить().Выбрать();

	Если Статусы.Следующий() Тогда
		НомерОтчета = Статусы.НомерОтчета;
		ВремяОкончанияВыгрузкиОбъявленийНаСайт = Статусы.ВремяОкончанияВыгрузкиОбъявленийНаСайт;
		ВремяСозданияОтчета = Статусы.ВремяСозданияОтчета;
		НазваниеОрганизации = Статусы.НазваниеОрганизации;
		ВремяГенерацииДанногоОтчета = Статусы.ВремяГенерацииДанногоОтчета;
		ОбщийСтатусВыгрузки = Статусы.ОбщийСтатусВыгрузки;
		ВерсияФорматаОтчета = Статусы.ВерсияФорматаОтчета;
	Иначе
		ТекущаяДата = ТекущаяДатаСеанса();
		НомерОтчета = 0;
		ВремяОкончанияВыгрузкиОбъявленийНаСайт = ТекущаяДата;
		ВремяСозданияОтчета = ТекущаяДата;
		НазваниеОрганизации = "";
		ВремяГенерацииДанногоОтчета = ТекущаяДата;
		ОбщийСтатусВыгрузки = "";
		ВерсияФорматаОтчета = "";
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция НачатьФормированиеАвтозагрузки(УникальныйИдентификатор, Профиль, ДополнительныеПараметры)

	ПолноеИмяМетода = "МП_АвитоВызовСервера.СформироватьФайлАвтозагрузкиПрофиля";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
												  ПолноеИмяМетода,
												  Профиль,
												  ДополнительныеПараметры);
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФормированиеАвтозагрузки(Результат, ДополнительныеПараметры) Экспорт
	Возврат;
КонецПроцедуры

#КонецОбласти

#Область Инициализация

АдресСайта = "https://api.avito.ru";
КлючТокена = "access_token";

ШаблонПолучитьТокен = "%1/token/?grant_type=client_credentials&client_id=%2&client_secret=%3";
ШаблонПолучитьИнформациюОКлиенте = "%1/core/v1/accounts/self";
ШаблонПолучитьБаланс = "%1/core/v1/accounts/%2/balance/";
ШаблонПолучитьИнформациюПоОбъявлениям = "%1/core/v1/items?per_page=99&page=%2";

#КонецОбласти