#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормы//<ИмяТаблицыФормы>
//
//// Код процедур и функций
//
//#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)

	Профиль = Элементы.Список.ТекущиеДанные.Ссылка;
	ВидМаркетплейса = Элементы.Список.ТекущиеДанные.ВидМаркетплейса;
	
	// Параметры ожидания для фоновой обработки
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Интервал = 1;

	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Текст = СтрШаблон("Файл выгрузки для профиля '%1' сформирован",
															   Строка(Профиль));

	// Обработка завершения
	ДополнительныеПараметры = Новый Структура("ИмяОбработки", "НачатьФормированиеАвтозагрузки");
	ОбработкаЗавершения = Новый ОписаниеОповещения("ПриЗавершенииФормированиеАвтозагрузки",
												   ЭтотОбъект,
												   ДополнительныеПараметры);
	
	// Формирование файла автозагрузки 
	ДлительнаяОперация = НачатьФормированиеАвтозагрузки(УникальныйИдентификатор,
														Профиль,
														ВидМаркетплейса,
														ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОбработкаЗавершения, ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокОбъявлений(Команда)

	Профиль = Элементы.Список.ТекущиеДанные.Ссылка;
	ВидМаркетплейса = Элементы.Список.ТекущиеДанные.ВидМаркетплейса;

	Если ВидМаркетплейса <> ПредопределенноеЗначение("Перечисление.МП_ВидыМаркетплейсов.Avito") Тогда
		Возврат;
	КонецЕсли;

	// Параметры ожидания для фоновой обработки
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Интервал = 1;

	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Текст = СтрШаблон("Список объявлений на сайте Avito для профиля '%1' обновлен",
															   Строка(Профиль));

	// Обработка завершения
	ДополнительныеПараметры = Новый Структура("ИмяОбработки", "ОбновлениеСпискаОбъявлений");
	ОбработкаЗавершения = Новый ОписаниеОповещения("ПриЗавершенииОбновленияСпискаОбъявлений",
												   ЭтотОбъект,
												   ДополнительныеПараметры);
	
	//  
	ДлительнаяОперация = НачатьОбновлениеОбъявленийПоАвито(УникальныйИдентификатор,
														   Профиль);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОбработкаЗавершения, ПараметрыОжидания);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция НачатьФормированиеАвтозагрузки(УникальныйИдентификатор, Профиль, ВидМаркетплейса, ДополнительныеПараметры)

	ПолноеИмяМетода = "МП_ДромВызовСервера.СформироватьПрайс";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
												  ПолноеИмяМетода,
												  Профиль,
												  ДополнительныеПараметры);
КонецФункции

&НаСервереБезКонтекста
Функция НачатьОбновлениеОбъявленийПоАвито(УникальныйИдентификатор, Профиль)

	ПолноеИмяМетода = "МП_АвитоВызовСервера.ОбновитьРучныеОбъявленияПрофиля";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
												ПолноеИмяМетода,
												Профиль);
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФормированиеАвтозагрузки(Результат, ДополнительныеПараметры) Экспорт
	
//	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.МП_СостояниеПрофилей"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.МП_Профили"));

КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииОбновленияСпискаОбъявлений(Результат, ДополнительныеПараметры) Экспорт
	
//	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.МП_СостояниеПрофилей"));
//	ОповеститьОбИзменении(Тип("СправочникСсылка.МП_Профили"));

КонецПроцедуры

#КонецОбласти