
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПодкатегорияПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТипДеталиПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаДеталейПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НазваниеДеталиПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьНаименование()
	
	Перем ДляНаименования;
	
	ДляНаименования = Новый Массив();
	
	ДобавитьНеПустуюСтроку(Элементы.Категория.ТекстРедактирования, ДляНаименования);
	ДобавитьНеПустуюСтроку(Элементы.Подкатегория.ТекстРедактирования, ДляНаименования);
	ДобавитьНеПустуюСтроку(Элементы.ТипДетали.ТекстРедактирования, ДляНаименования);
	ДобавитьНеПустуюСтроку(Элементы.ГруппаДеталей.ТекстРедактирования, ДляНаименования);
	ДобавитьНеПустуюСтроку(Элементы.НазваниеДетали.ТекстРедактирования, ДляНаименования);
	
	Объект.Наименование = СтрСоединить(ДляНаименования, "/");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНеПустуюСтроку(Строка, Массив);

	Если Не ПустаяСтрока(Строка) Тогда
		Массив.Добавить(Строка);	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

