//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьСправочник(Команда)
	
	// Параметры ожидания для фоновой обработки
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Интервал = 1;

	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Текст = "Обновление каталога завершено";

	// Обработка завершения
	ПараметрыОбновления = Новый Структура("ИмяОбработки", "НачатьОбновлениеКаталога");
	ОбработкаЗавершения = Новый ОписаниеОповещения("ПриЗавершенииОбновленияКаталога",
												   ЭтотОбъект,
												   ПараметрыОбновления);
	
	// Формирование файла автозагрузки 
	ДлительнаяОперация = НачатьОбновлениеКаталога(УникальныйИдентификатор, ПараметрыОбновления);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОбработкаЗавершения, ПараметрыОжидания);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция НачатьОбновлениеКаталога(УникальныйИдентификатор, ДополнительныеПараметры)

	ПолноеИмяМетода = "АСМ_КаталогВызовСервера.ОбновитьКаталог";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, ПолноеИмяМетода, ДополнительныеПараметры);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииОбновленияКаталога(Результат, ДополнительныеПараметры) Экспорт
	
//	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.МП_СостояниеПрофилей"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.АСМ_Марки"));

КонецПроцедуры

#КонецОбласти