// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ПрограммныйИнтерфейс

Процедура Подключаемый_ОткрытьФормуМоделейАвтомобилей(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт

	ПараметрыВызова = Новый Структура("Номенклатура", ПараметрКоманды);

	ОткрытьФорму("Обработка.КА2_УправлениеНаборомМоделейДляНоменклатуры.Форма.ФормаЭлементаНоменклатуры",
				 ПараметрыВызова,
				 ПараметрыВыполненияКоманды.Форма,
				 ПараметрыВыполненияКоманды.Форма.УникальныйИдентификатор,
				 ,
				 ,
				 ,
				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

Процедура Подключаемый_ОткрытьФормуОтборПоКаталогуАвтомобилей(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт

	ПараметрыВызова = Новый Структура;

	ОткрытьФорму("Обработка.КА2_УправлениеНаборомМоделейДляНоменклатуры.Форма.ДляОтбораСписка",
				 ПараметрыВызова,
				 ПараметрыВыполненияКоманды.Форма,
				 ПараметрыВыполненияКоманды.Форма.УникальныйИдентификатор,
				 ,
				 ,
				 ,
				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

Процедура Подключаемый_ОткрытьФормуДобавитьМоделейАвтомобилей(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт

	ПараметрыВызова = Новый Структура("Номенклатура", ПараметрКоманды);

	ОткрытьФорму("Обработка.КА2_УправлениеНаборомМоделейДляНоменклатуры.Форма.ФормаСпискаНоменклатуры",
				 ПараметрыВызова,
				 ПараметрыВыполненияКоманды.Форма,
				 ПараметрыВыполненияКоманды.Форма.УникальныйИдентификатор,
				 ,
				 ,
				 ,
				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

Процедура Подключаемый_НеБСП_ОткрытьФормуОтборПоКаталогуАвтомобилей(Форма) Экспорт

	ПараметрКоманды = Новый Структура;
	ПараметрыВыполненияКоманды = Новый Структура("Форма", Форма);

	Подключаемый_ОткрытьФормуОтборПоКаталогуАвтомобилей(ПараметрКоманды, ПараметрыВыполненияКоманды);

КонецПроцедуры

Процедура Подключаемый_НеБСП_ОтменитьОтборПоКаталогуАвтомобилей(Форма) Экспорт

	КА2_ФильтрКлиентСервер.ОчиститьОтборПоМоделиАвтомобиля(Форма);
	
КонецПроцедуры

#КонецОбласти