//
//	Филимонов И.В.
//		+7 913 240 81 77
//	
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает доступные на дату ресурсы
// 
// Параметры:
//  Дата - Дата - Дата
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Доступные ресурсы на дату
Функция ДоступныеРесурсыНаДату(Дата) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаГрафика", Дата);

	Запрос.Текст = "ВЫБРАТЬ
				   |	АС2_Ресурсы.Ссылка КАК Ссылка,
				   |	АС2_Ресурсы.Наименование КАК Наименование,
				   |	АС2_Ресурсы.Описание КАК Описание,
				   |	АС2_Ресурсы.Календарь КАК Календарь,
				   |	АС2_Ресурсы.Пользователь.Представление КАК Сотрудник,
				   |	""                              "" КАК РабочаяОбласть
				   |ИЗ
				   |	Справочник.АС2_Ресурсы КАК АС2_Ресурсы
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
				   |		ПО АС2_Ресурсы.Календарь = КалендарныеГрафики.Календарь
				   |ГДЕ
				   |	КалендарныеГрафики.ДатаГрафика = &ДатаГрафика
				   |	И КалендарныеГрафики.ДеньВключенВГрафик";

	НаборРесурсов = Запрос.Выполнить().Выгрузить();

	Возврат НаборРесурсов;

КонецФункции

#КонецОбласти

#КонецЕсли