// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения.
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт

	Если Параметры.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда

		КомандаАвтокаталог = КомандыЗаполнения.Добавить();

		КомандаАвтокаталог.Обработчик = "КА2_ПодключаемыеКомандыКлиент.Подключаемый_ОткрытьФормуМоделейАвтомобилей";
		КомандаАвтокаталог.Представление = НСтр("ru= 'Модели автомобилей'");
		КомандаАвтокаталог.ИмяФормы = "ФормаЭлемента";
		КомандаАвтокаталог.РежимЗаписи = "Записывать";
		КомандаАвтокаталог.МножественныйВыбор = Ложь;
		КомандаАвтокаталог.ИзменяетВыбранныеОбъекты = Истина;
		КомандаАвтокаталог.Порядок = 6;
		КомандаАвтокаталог.Важность = "Обычное";
		КомандаАвтокаталог.Вид = "ЗаполнениеОбъектов";

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли