// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТолькоИзБазыПоставщика = Истина;
	МаркаНаименование = Неопределено;
	ТолькоИмеющиесяВКлючах = Неопределено;

	Если Параметры.ОтборПоКаталогуАвтомобилей = Истина Тогда
		ТолькоИмеющиесяВКлючах = Истина;
	ИначеЕсли Параметры.УправлениеНаборомМоделейДляНоменклатуры = Истина Тогда
		ТолькоИмеющиесяВКлючах = Ложь;
	КонецЕсли;

	Если ТолькоИмеющиесяВКлючах <> Неопределено
		 И Параметры.Отбор.Свойство("Ссылка", МаркаНаименование)
		 И ТипЗнч(МаркаНаименование) = Тип("СправочникСсылка.КА2_НаименованияМарок") Тогда

		МаркаНаименованиеСсылка = МаркаНаименование;

		УстановитьОтборПоНаборуМоделей();
		
		СтандартнаяОбработка = Ложь;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТолькоИзБазыПоставщикаПриИзменении(Элемент)
	УстановитьОтборПоНаборуМоделей();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоНаборуМоделей()

	НаборМоделей = Справочники.КА2_Модели.НайтиПоНаименованиюМарки(МаркаНаименованиеСсылка,
																   ТолькоИмеющиесяВКлючах,
																   ТолькоИзБазыПоставщика);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Ссылка",
																			НаборМоделей,
																			ВидСравненияКомпоновкиДанных.ВСписке);
КонецПроцедуры

#КонецОбласти
