&НаКлиенте
Процедура МП_ТаблицаЗначенийСвойствВыборПеред(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элемент.ТекущиеДанные;

	Если ТекущиеДанные.Наименование = "Юла" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОбработкаЗавершения = Новый ОписаниеОповещения("ПриЗавершенииЗагрузки", ЭтотОбъект);
		
		ОткрытьФорму("Справочник.МП_ЮлаРазмещенияОбъявлений.Форма.ФормаВыбора",
					 ,
					 Элемент.ТекущиеДанные.Значение,
					 УникальныйИдентификатор,
					 ,
					 ,
					 ОбработкаЗавершения,
					 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииЗагрузки(Результат, ДополнительныеПараметры) Экспорт

	// Пользователь отменил задание
	Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;

	Элементы.ТаблицаЗначенийСвойств.ТекущиеДанные.Значение = Строка(Результат);
	Модифицированность = Истина;
	
КонецПроцедуры
