// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ПрограммныйИнтерфейс

&Вместо("НеУдаляемыеЭлементыОтборов")
Функция КА2_НеУдаляемыеЭлементыОтборов()

	НеУдаляемыеЭлементы = Новый Массив;

	НеУдаляемыеЭлементы.Добавить("ПоискПоПодстроке");
	НеУдаляемыеЭлементы.Добавить("ЦеныНоменклатуры");
	НеУдаляемыеЭлементы.Добавить("ЦенаХарактеристики");
	НеУдаляемыеЭлементы.Добавить("ГруппаТолькоВНаличии");
	НеУдаляемыеЭлементы.Добавить("ОтборПоВидуНоменклатуры");
	НеУдаляемыеЭлементы.Добавить("ОтборПоВладельцуХарактеристик");
	НеУдаляемыеЭлементы.Добавить("ОтборПоТипуНоменклатуры");
	НеУдаляемыеЭлементы.Добавить("ОтборПоУмолчанию");
	НеУдаляемыеЭлементы.Добавить("ОтборОсобенностьУчета");
	НеУдаляемыеЭлементы.Добавить("ОтборКоллекцияНоменклатуры");
	НеУдаляемыеЭлементы.Добавить("ОтборВидАлкогольнойПродукцииМаркируемый");

	// КА2++
	НеУдаляемыеЭлементы.Добавить("ОтборПоМаркеИМодели");
	// КА2++

	Возврат НеУдаляемыеЭлементы

КонецФункции

#КонецОбласти

#Область ОбщиеОбработчикиСобытийФорм

// Вызывается из обработчика события "ПриСозданииНаСервере" форм списков.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка, формы выбора.
//
&После("ПриСозданииНаСервере")
Процедура КА2_ПриСозданииНаСервере(Форма) Экспорт

	//@skip-warning
	Параметры = Форма.Параметры;
	//@skip-warning
	Элементы = Форма.Элементы;
	//@skip-warning
	ЭтоФормаСпискаНоменклатуры = ПодборТоваровКлиентСервер.ЭтоФормаСпискаНоменклатуры(Форма);
	ЭтоФормаВыбораНоменклатуры = ПодборТоваровКлиентСервер.ЭтоФормаВыбораНоменклатуры(Форма);

	Если ЭтоФормаВыбораНоменклатуры Тогда
		КА2_ПодключаемыеКомандыВызовСервера.Подключаемый_НеБСП_КомандыОтбораПоКаталогуАвтомобилей(Форма);
		КА2_ПодключаемыеКомандыВызовСервера.Подключаемый_НеБСП_КомандыОчисткиОтбораПоКаталогуАвтомобилей(Форма);
	ИначеЕсли ЭтоФормаСпискаНоменклатуры Тогда
		КА2_ПодключаемыеКомандыВызовСервера.Подключаемый_НеБСП_КомандыОчисткиОтбораПоКаталогуАвтомобилей(Форма);		 
	КонецЕсли;

	КА2_ФильтрКлиентСервер.ГруппаОтбораМаркаМодель(Форма);

КонецПроцедуры

// Вызывается из обработчика события "ПриСозданииНаСервере" форм подборов.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма подбора.
//
&После("ПриСозданииФормыПодбораНаСервере")
Процедура КА2_ПриСозданииФормыПодбораНаСервере(Форма) Экспорт

	//@skip-warning
	Параметры = Форма.Параметры;
	//@skip-warning
	Элементы = Форма.Элементы;
	
	ЭтоФормаПодбораВДокументыПродажи = ПодборТоваровКлиентСервер.ЭтоФормаПодбораВДокументыПродажи(Форма);
	ЭтоФормаПодбораВДокументыЗакупки = ПодборТоваровКлиентСервер.ЭтоФормаПодбораВДокументыЗакупки(Форма);

	Если ЭтоФормаПодбораВДокументыЗакупки Или ЭтоФормаПодбораВДокументыПродажи Тогда
		КА2_ПодключаемыеКомандыВызовСервера.Подключаемый_НеБСП_КомандыОтбораПоКаталогуАвтомобилей(Форма);
		КА2_ПодключаемыеКомандыВызовСервера.Подключаемый_НеБСП_КомандыОчисткиОтбораПоКаталогуАвтомобилей(Форма);		 
	КонецЕсли;

	КА2_ФильтрКлиентСервер.ГруппаОтбораМаркаМодель(Форма);

КонецПроцедуры

#КонецОбласти