//
//	Филимонов И.В.
//		+7 913 240 81 77
//

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = "Выберите файл справочника зон показа";

	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)

	ОчиститьСообщения();

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;

	ДлительнаяОперация = НачатьОбновлениеЗонПоказа(УникальныйИдентификатор, ИмяФайла);
	
	// Подключение обработчика завершения фонового задания.
	ОбработкаЗавершения = Новый ОписаниеОповещения("ПриЗавершенииОбновленияЗонПоказа", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОбработкаЗавершения, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция НачатьОбновлениеЗонПоказа(УникальныйИдентификатор, ИмяФайла)

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
												"МП_АвитоВызовСервера.ОбновитьЗоныПоказа",
												ИмяФайла);
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииОбновленияЗонПоказа(Результат, ДополнительныеПараметры) Экспорт
	
	// Обновление списка объявлений
	ОповеститьОбИзменении(Тип("СправочникСсылка.МП_АвитоЗоныПоказа"));
		
	// Пользователь отменил задание
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти