//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Для Каждого Элемент Из ЭтотОбъект Цикл

		ЗаполнитьНазваниеОбъявления(Элемент);
		ЗаполнитьИдентификаторОбъявления(Элемент);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьИдентификаторОбъявления(Элемент)

	Профиль = ?(Элемент.Профиль.Пустая(), "БезПрофиля", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Профиль,
																								  "Код"));
	Если ПустаяСтрока(Элемент.Идентификатор) И Элемент.Номенклатура.Пустая() Тогда
		Идентификатор = Профиль + Строка(Элемент.ИдентификаторАвито) + ТекущаяДатаСеанса();
	Иначе

		Номенклатура = ?(Элемент.Номенклатура.Пустая(),
						 "БезНоменклатуры",
						 ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Номенклатура, "Код"));
		Характеристика = ?(Элемент.Характеристика.Пустая(),
						   "БезХарактеристики",
						   ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Характеристика, "Наименование"));
		Идентификатор = СтрШаблон("%1$%2$%3", Профиль, Номенклатура, Характеристика);

	КонецЕсли;

	Элемент.Идентификатор = Идентификатор;

КонецПроцедуры

Процедура ЗаполнитьНазваниеОбъявления(Элемент)

	МаркиМодели = УправлениеСвойствами.ЗначениеСвойства(Элемент.Номенклатура, ПараметрыСеанса.МП_ПВХ_МаркиМодели);

	Если МаркиМодели <> Неопределено Тогда

		ТоварнаяКатегория = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Номенклатура, "ТоварнаяКатегория");
		НаименованиеТовара = ?(ЗначениеЗаполнено(ТоварнаяКатегория), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТоварнаяКатегория, "Наименование"), Неопределено);
		
		Если НаименованиеТовара <> Неопределено Тогда
			НазваниеОбъявления = СокрЛП(СтрШаблон("%1 %2", НаименованиеТовара, МаркиМодели));
		Иначе

			НаименованиеХарактеристики = ?(Элемент.Характеристика.Пустая(),
										   "",
										   ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Характеристика,
																					 "Наименование"));
			НаименованиеНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Номенклатура, "Наименование");
			НазваниеОбъявления = СокрЛП(СтрШаблон("%1 %2 %3",
												  НаименованиеНоменклатуры,
												  НаименованиеХарактеристики,
												  МаркиМодели.Наименование));
		КонецЕсли;

	Иначе

		НаименованиеХарактеристики = ?(Элемент.Характеристика.Пустая(),
									   "",
									   ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Характеристика,
																				 "Наименование"));
		НаименованиеНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Номенклатура, "Наименование");

		НазваниеОбъявления = СокрЛП(СтрШаблон("%1 %2", НаименованиеНоменклатуры, НаименованиеХарактеристики));

	КонецЕсли;

	ДлинаНазванияОбъявления = СтрДлина(НазваниеОбъявления);

	Если ДлинаНазванияОбъявления > 50 Тогда
		НазваниеОбъявления = Лев(НазваниеОбъявления, 47) + "...";
	КонецЕсли;

	Элемент.НазваниеОбъявления = ?(ДлинаНазванияОбъявления > 0, НазваниеОбъявления, Элемент.НазваниеОбъявления);

КонецПроцедуры

#КонецОбласти

#КонецЕсли