// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ОтборПоКаталогуАвтомобилей") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
					   |	КА2_КлючиМоделей.Марка.Владелец КАК Ссылка
					   |ИЗ
					   |	Справочник.КА2_КлючиМоделей КАК КА2_КлючиМоделей
					   |ГДЕ
					   |	НЕ КА2_КлючиМоделей.ПометкаУдаления";
		НаборМарок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																				"Ссылка",
																				НаборМарок,
																				ВидСравненияКомпоновкиДанных.ВСписке);

		СтандартнаяОбработка = Ложь;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти