// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру, соответствующую данным регистра
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * Номенклатура 
// * ХарактеристикаНоменклатуры 
// * КлючМодели 
// * Совместимо 
// * Номер 
Функция СтруктураПараметров() Экспорт
	
	Возврат Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, КлючМодели, Совместимо, Номер");
		
КонецФункции

#КонецОбласти

#КонецЕсли
