//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Считывание настроек из хранилища
	ИмяПодсистемы = Метаданные.Подсистемы.МП_Маркетплейсы.Имя;
	КлючНастроек = СтрШаблон("%1ПубликуемыеДопРеквизиты", ИмяПодсистемы);

	УстановитьПривилегированныйРежим(Истина);

	ПубликуемыеДопРеквизиты = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяПодсистемы,
																			   КлючНастроек,
																			   ,
																			   ,
																			   "ТрубинРВ");

	Если ПубликуемыеДопРеквизиты <> Неопределено Тогда
		Если ТипЗнч(ПубликуемыеДопРеквизиты) = Тип("СписокЗначений") Тогда
			КешРеквизитов = ПубликуемыеДопРеквизиты.ВыгрузитьЗначения();
			ВыбранныеРеквизиты.ЗагрузитьЗначения(КешРеквизитов);
		Иначе
			ВыбранныеРеквизиты.ЗагрузитьЗначения(ПубликуемыеДопРеквизиты);
		КонецЕсли;

	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПубликуемыеДопРеквизиты", ПубликуемыеДопРеквизиты);
	Запрос.УстановитьПараметр("Родитель",
							  Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоНаименованию("Номенклатура",
																									  Истина));
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	НаборыДопРеквизитов.Свойство КАК Свойство,
				   |	НаборыДопРеквизитов.Свойство.Имя КАК Имя
				   |ИЗ
				   |	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДопРеквизитов
				   |ГДЕ
				   |	НаборыДопРеквизитов.Ссылка В ИЕРАРХИИ (&Родитель)
				   |	И НЕ НаборыДопРеквизитов.Свойство В (&ПубликуемыеДопРеквизиты)
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	Имя";

	ВсеДопРеквизиты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Свойство");

	ВсеРеквизиты.ЗагрузитьЗначения(ВсеДопРеквизиты);

	УстановитьПривилегированныйРежим(Ложь);

	ВсеРеквизиты.СортироватьПоЗначению();
	ВыбранныеРеквизиты.СортироватьПоЗначению();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормы//<ИмяТаблицыФормы>
//
//// Код процедур и функций
//
//#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	СохранитьИЗакрытьНаСервере();
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьИЗакрытьНаСервере()

	ИмяПодсистемы = Метаданные.Подсистемы.МП_Маркетплейсы.Имя;
	КлючНастроек = СтрШаблон("%1ПубликуемыеДопРеквизиты", ИмяПодсистемы);

	УстановитьПривилегированныйРежим(Истина);

	НаСохранение = ВыбранныеРеквизиты.ВыгрузитьЗначения();
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяПодсистемы, КлючНастроек, НаСохранение,, "ТрубинРВ");

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти