//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает строку из имен реквизитов регистра через запятую
// 
// Возвращаемое значение:
//  Строка - Структура реквизитов
Функция СтруктураРеквизитов() Экспорт

	НаборРеквизитов = Новый Массив;
	КоллекцияКлассов = Новый Массив;

	МетаданныеРегистра = Метаданные.РегистрыСведений.АС2_ЗагрузкаРесурсов;

	КоллекцияКлассов.Добавить(МетаданныеРегистра.Измерения);
	КоллекцияКлассов.Добавить(МетаданныеРегистра.Ресурсы);
	КоллекцияКлассов.Добавить(МетаданныеРегистра.Реквизиты);
	КоллекцияКлассов.Добавить(МетаданныеРегистра.СтандартныеРеквизиты);

	Для Каждого Раздел Из КоллекцияКлассов Цикл
		Для Каждого Реквизит Из Раздел Цикл
			НаборРеквизитов.Добавить(Реквизит.Имя);
		КонецЦикла;
	КонецЦикла;

	Возврат СтрСоединить(НаборРеквизитов, ",");

КонецФункции

Функция КоллекцияРаботНаДату(Дата) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	АС2_ЗагрузкаРесурсов.Ресурс КАК Ресурс,
				   |	АС2_ЗагрузкаРесурсов.ЗаказКлиента КАК ЗаказКлиента,
				   |	АС2_ЗагрузкаРесурсов.Начало КАК Начало,
				   |	АС2_ЗагрузкаРесурсов.Окончание КАК Окончание,
				   |	АС2_ЗагрузкаРесурсов.Автомобиль КАК Автомобиль,
				   |	АС2_ЗагрузкаРесурсов.Комментарий КАК Комментарий,
				   |	АС2_ЗагрузкаРесурсов.Идентификатор КАК Идентификатор,
				   |	АС2_ЗагрузкаРесурсов.ВРаботе КАК ВРаботе
				   |ИЗ
				   |	РегистрСведений.АС2_ЗагрузкаРесурсов КАК АС2_ЗагрузкаРесурсов
				   |ГДЕ
				   |	(НАЧАЛОПЕРИОДА(АС2_ЗагрузкаРесурсов.Начало, ДЕНЬ) = &АктуальнаяДата
				   |	ИЛИ НАЧАЛОПЕРИОДА(АС2_ЗагрузкаРесурсов.Окончание, ДЕНЬ) = &АктуальнаяДата)";
	Запрос.УстановитьПараметр("АктуальнаяДата", Дата);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#КонецЕсли