//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ТекЗапись Из ЭтотОбъект Цикл

		Если Не ЗначениеЗаполнено(ТекЗапись.Идентификатор) Тогда
			ТекЗапись.Идентификатор = Новый УникальныйИдентификатор;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли