//
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ПрограммныйИнтерфейс

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииОбработчиковУстановкиПараметровСеанса.
Процедура УстановкаПараметровСеансаПВХ_МаркиМодели(ИмяПараметра, УстановленныеПараметры) Экспорт

	РеквизитПоиска = "Имя";
	ЗначениеПоиска = "ДР_МаркиМодели";
	
	ПВХ_МаркиМодели = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(РеквизитПоиска, ЗначениеПоиска);
	
	ПараметрыСеанса.МП_ПВХ_МаркиМодели = ПВХ_МаркиМодели; 
	
	УстановленныеПараметры.Добавить(ИмяПараметра);

КонецПроцедуры

#КонецОбласти