//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Список выбора для СтатусРазмещенияНаСайте
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	МП_АвитоОбъявления.СтатусРазмещенияНаСайте КАК Статус
				   |ИЗ
				   |	РегистрСведений.УдалитьМП_АвитоОбъявления КАК МП_АвитоОбъявления
				   |УПОРЯДОЧИТЬ ПО
				   |	Статус";
	ТЗНаборСтатусов = Запрос.Выполнить().Выгрузить();
	НаборСтатусов = ТЗНаборСтатусов.ВыгрузитьКолонку("Статус");

	Элементы.ОтборСтатусРазмещенияНаСайте.СписокВыбора.ЗагрузитьЗначения(НаборСтатусов);

	// Список выбора для СтатусРазмещенияНаСайте
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	МП_АвитоОбъявления.ОбщийСтатусОбработкиОбъявления КАК Статус
				   |ИЗ
				   |	РегистрСведений.УдалитьМП_АвитоОбъявления КАК МП_АвитоОбъявления
				   |УПОРЯДОЧИТЬ ПО
				   |	Статус";
	ТЗНаборСтатусов = Запрос.Выполнить().Выгрузить();
	НаборСтатусов = ТЗНаборСтатусов.ВыгрузитьКолонку("Статус");

	Элементы.ОтборОбщийСтатусОбработкиОбъявления.СписокВыбора.ЗагрузитьЗначения(НаборСтатусов);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьОтборРавно(Элементы.Профиль);
	УстановитьОтборРавно(Элементы.Менеджер);
	УстановитьОтборРавно(Элементы.СтатусРазмещенияНаСайте);
	УстановитьОтборРавно(Элементы.ОбщийСтатусОбработкиОбъявления);
	УстановитьОтборПоУправление();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УправлениеПриИзменении(Элемент)
	УстановитьОтборПоУправление();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборРавно(Элемент)

	ИмяПоля = СтрЗаменить(Элемент.Имя, "Отбор", "");
	ПравоеЗначение = ЭтаФорма[ИмяПоля];
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			ИмяПоля,
																			ПравоеЗначение,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(ПравоеЗначение));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьОбъявления(Команда)

	Если ЗначениеЗаполнено(Профиль) Тогда
		ДлительнаяОперация = НачатьОбновлениеОбъявлений(УникальныйИдентификатор, Профиль);

		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;

		// Подключение обработчика завершения фонового задания.
		ОбработкаЗавершения = Новый ОписаниеОповещения("ПриЗавершенииОбновленияОбъявлений", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОбработкаЗавершения, ПараметрыОжидания);

	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбран профиль'"), , "ОтборПрофиль");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьАвтозагрузку(Команда)

	ПакетАвито = МП_АвитоВызовСервера.СформироватьФайлАвтозагрузкиПрофиля(Профиль);
	ОбщегоНазначенияКлиент.СообщитьПользователю(ПакетАвито);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборПоУправление()

	ИспользоватьОтбор = Не (Управление = "Все" Или ПустаяСтрока(Управление));

	ВидСравненияДляСписка = ?(Управление = "Автозагрузка",
							  ВидСравненияКомпоновкиДанных.Заполнено,
							  ВидСравненияКомпоновкиДанных.НеЗаполнено);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Номенклатура",
																			ОбщийСтатусОбработкиОбъявления,
																			ВидСравненияДляСписка,
																			,
																			ИспользоватьОтбор);
КонецПроцедуры

#Область КомандаОбновитьОбъявления

&НаСервереБезКонтекста
Функция НачатьОбновлениеОбъявлений(УникальныйИдентификатор, Профиль)

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
												"МП_АвитоВызовСервера.ОбновитьОбъявленияПрофиля",
												Профиль);
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииОбновленияОбъявлений(Результат, ДополнительныеПараметры) Экспорт
	
	// Обновление списка объявлений
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.УдалитьМП_АвитоИдентификаторыОбъявлений"));
		
	// Пользователь отменил задание
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//	// Ошибка выполнения задания
	//	Если Результат.Статус = "Ошибка" Тогда
	////		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	//	КонецЕсли;
	//
	//	// Успешное выполнение обновления
	//	Если Результат.Статус = "Выполнено" Тогда
	//
	//		РезультатОбновления = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	//		
	//		// Вывести результат обновления справочника
	//
	//	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти