//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Номенклатура <> Справочники.Номенклатура.ПустаяСсылка() Тогда

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Номенклатура", Параметры.Номенклатура);
		Запрос.Текст = "ВЫБРАТЬ
					   |	АСМ_КлючиМоделей.Ключ КАК КлючМодели,
					   |	АСМ_КлючиМоделей.Номер КАК НомерСтроки
					   |ИЗ
					   |	РегистрСведений.АСМ_КлючиМоделей КАК АСМ_КлючиМоделей
					   |ГДЕ
					   |	АСМ_КлючиМоделей.Номенклатура = &Номенклатура
					   |
					   |УПОРЯДОЧИТЬ ПО
					   |	Номер";

		Выборка = Запрос.Выполнить().Выбрать();

		Пока Выборка.Следующий() Цикл

			НоваяСтрока = Объект.Модели.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);

		КонецЦикла;

	Иначе
		// TODO: Обработать создание формы при не заданной номенклатуре
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МоделиКлючМоделиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	ОткрытьФорму("Обработка.АСМ_СписокКлючейМоделей.Форма.ФормаКлюча");
КонецПроцедуры
#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормы//<ИмяТаблицыФормы>
//
//// Код процедур и функций
//
//#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)

	НаборКлючей = Новый Массив;

	Для Каждого Элемент Из Объект.Модели Цикл
		НаборКлючей.Добавить(Элемент.КлючМодели);
	КонецЦикла;

	ОбновитьЗаписиРегистров(Параметры.Номенклатура, НаборКлючей);

	ОповеститьОбИзменении(Тип("СправочникСсылка.Номенклатура"));

	ЭтотОбъект.Закрыть();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ОбновитьЗаписиРегистров(Номенклатура, НаборКлючей)

	// Очистка существующих записей
	НаборЗаписей = РегистрыСведений.АСМ_КлючиМоделей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура, Истина);
	НаборЗаписей.Записать(Истина);
	
	// Формирование списка
	Индекс = 1;
	Для Каждого Эл Из НаборКлючей Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Номенклатура = Номенклатура;
		НоваяЗапись.Ключ = Эл;
		НоваяЗапись.Номер = Индекс;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	// Запись списка
	НаборЗаписей.Записать(Истина);

	Возврат Истина;

КонецФункции

#КонецОбласти