//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет состав программного интерфейса для интеграции с конфигурацией.
//
// Параметры:
//   Настройки - Структура - Настройки интеграции этого объекта.
//       См. возвращаемое значение функции ПодключаемыеКоманды.НастройкиПодключаемыхОтчетовИОбработок().
//
Процедура ПриОпределенииНастроек(Настройки) Экспорт

	Настройки.Размещение.Добавить(Метаданные.Документы.ЗаказКлиента);

	Настройки.ДобавитьКомандыОтчетов = Истина;

КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт

	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.АС2_ПривязкаЗаказНарядаКГрафику) Тогда

		Команда = КомандыОтчетов.Добавить();
		Команда.ИмяПараметраФормы = "Отбор.Ссылка";
		Команда.Идентификатор = "ПривязкаЗаказНарядаКГрафику";
		Команда.Важность = "Важное";
		Команда.КлючВарианта = "Основной";
		Команда.Представление = НСтр("ru = 'Записан на установку...'");
		Команда.МножественныйВыбор = Ложь;
		Команда.Порядок = 1;

		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда,
															"ЭтоЗаказНаряд",
															Истина,
															ВидСравненияКомпоновкиДанных.Равно);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли