// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ПрограммныйИнтерфейс

&После("ПриОпределенииОбъектовСКомандамиЗаполнения")
Процедура КА2_ПриОпределенииОбъектовСКомандамиЗаполнения(Объекты) Экспорт

	СправочникНоменклатура = Метаданные.Справочники.Номенклатура;

	Если Объекты.Найти(СправочникНоменклатура) = Неопределено Тогда
		Объекты.Добавить(СправочникНоменклатура);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти