// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДополнительныеДанные(Ссылка) Экспорт

	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("ТипТС", Неопределено);
	ДополнительныеДанные.Вставить("Марка", Неопределено);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				   |	КА2_Типы.Ссылка КАК ТипТС,
				   |	КА2_Марки.Ссылка КАК Марка
				   |ИЗ
				   |	Справочник.КА2_Марки КАК КА2_Марки
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КА2_Типы КАК КА2_Типы
				   |		ПО КА2_Типы.Код = КА2_Марки.id_car_type
				   |ГДЕ
				   |	КА2_Марки.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Ссылка);

	КоллекцияМоделей = Запрос.Выполнить().Выбрать();
	Если КоллекцияМоделей.Количество() = 1 Тогда
		КоллекцияМоделей.Следующий();
		ДополнительныеДанные.Вставить("ТипТС", КоллекцияМоделей.ТипТС);
		ДополнительныеДанные.Вставить("Марка", КоллекцияМоделей.Марка);
	КонецЕсли;

	Возврат ДополнительныеДанные;

КонецФункции

#КонецОбласти

#КонецЕсли
