//
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ПрограммныйИнтерфейс

Функция ТегиHTML() Экспорт

	ТегиHTML = Новый Структура;

	ТегиHTML.Вставить("Пи", "<p>");
	ТегиHTML.Вставить("ПиК", "</p>");
	ТегиHTML.Вставить("Стронг", "<strong>");
	ТегиHTML.Вставить("СтронгК", "</strong>");
	ТегиHTML.Вставить("Юл", "<ul>");
	ТегиHTML.Вставить("ЮлК", "</ul>");
	ТегиHTML.Вставить("Ли", "<li>");

	Возврат ТегиHTML;

КонецФункции

Функция ИдентификаторФормированиеОбъявленийAvito() Экспорт
	Возврат "ФормированиеОбъявленийAvitoАвтоматически";
КонецФункции

Функция ИдентификаторФормированиеПрайсовДром() Экспорт
	Возврат "ФормированиеПрайсовДромАвтоматически";
КонецФункции

#КонецОбласти