//
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ОписаниеПеременных

&НаКлиенте
Перем НачальнаяСигнатураТокена;
&НаКлиенте
Перем КонечнаяСигнатураТокена;
&НаКлиенте
Перем ДлинаНачальнойСигнатурыТокена;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	urlРегистрации = МП_ЯндексМаркетКлиентСервер.urlРегистрации();

#Если Не ВебКлиент Тогда
	Адрес = urlРегистрации;
#КонецЕсли
#Если ВебКлиент Тогда
	ПерейтиПоНавигационнойСсылке(urlРегистрации);
#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если ЭтаФорма.ОписаниеОповещенияОЗакрытии <> Неопределено
		 И ЭтаФорма.ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Свойство("Токен") Тогда
		ЭтаФорма.ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Токен = Токен;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресДокументСформирован(Элемент)

	urlответа = Элементы.Адрес.Документ.URL;
	НачальнаяПозиция = СтрНайти(urlответа, НачальнаяСигнатураТокена);

	Если НачальнаяПозиция <> 0 Тогда
		
		КонечнаяПозиция = СтрНайти(urlответа, КонечнаяСигнатураТокена);
		ДлинаТокена = КонечнаяПозиция - НачальнаяПозиция - ДлинаНачальнойСигнатурыТокена;
		Токен = Сред(urlответа, НачальнаяПозиция + ДлинаНачальнойСигнатурыТокена, ДлинаТокена);
		
		ЭтаФорма.Закрыть();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Инициализация

НачальнаяСигнатураТокена = "#access_token=";
КонечнаяСигнатураТокена = "&token_type=";
ДлинаНачальнойСигнатурыТокена = СтрДлина(НачальнаяСигнатураТокена);

#КонецОбласти