// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//

#Область ОбработчикиКомандФормы

//@skip-warning
&НаКлиенте
Процедура ОткрытьОтборПоКаталогуАвтомобилей()
	
	КА2_ПодключаемыеКомандыКлиент.Подключаемый_НеБСП_ОткрытьФормуОтборПоКаталогуАвтомобилей(ЭтаФорма);
		
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура ОтменитьОтборПоКаталогуАвтомобилей()
	
	КА2_ПодключаемыеКомандыКлиент.Подключаемый_НеБСП_ОтменитьОтборПоКаталогуАвтомобилей(ЭтаФорма);
		
КонецПроцедуры

#КонецОбласти