//
//	Филимонов И.В.
//		+7 913 240 81 77
//		

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьДеревоМетаданных(РеквизитФормыВЗначение("СписокВыбораОбъектов"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрофильТокенНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ДополнительныеПараметры = Новый Структура("Токен", Объект.Токен);
	ПриПолученииТокена = Новый ОписаниеОповещения("ПриПолученииТокена", ЭтотОбъект, ДополнительныеПараметры);

	ОткрытьФорму("ОбщаяФорма.МП_ЯндексМаркетПолучениеТокена",
				 ,
				 ЭтаФорма,
				 УникальныйИдентификатор,
				 ,
				 ,
				 ПриПолученииТокена,
				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыИРеквизиты

&НаКлиенте
Процедура ПараметрыИРеквизитыКлассНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура ПриПолученииТокена(Результат, ДополнительныеПараметры) Экспорт

	Если ДополнительныеПараметры.Свойство("Токен") Тогда
		Объект.Токен = ДополнительныеПараметры.Токен;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДеревоМетаданных(ДеревоМетаданных)

	КлассыОбъектов = Новый Массив();
	
	КлассыОбъектов.Добавить();
	Нечто = Метаданные.Справочники.Найти("Номенклатура");
	
	КоллекцииОбъектовМетаданных = Новый Массив;
	КоллекцииОбъектовМетаданных.Добавить(Метаданные.Справочники);
	КоллекцииОбъектовМетаданных.Добавить(Метаданные.ПланыВидовХарактеристик);
	КоллекцииОбъектовМетаданных.Добавить(Метаданные.РегистрыСведений);
	
	
	Возврат;
КонецПроцедуры

#КонецОбласти