#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборыСписка();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрофильОтборПриИзменении(Элемент)
	УстановитьОтборыСписка();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьОбъявленияИзАвтозагрузкиПриИзменении(Элемент)
	УстановитьОтборыСписка();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборыСписка()

	ПрофильОтборВыбран = ЗначениеЗаполнено(Профиль);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"ИдентификаторАвтозагрузки",
																			"",
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			Не ПоказыватьОбъявленияИзАвтозагрузки);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Профиль",
																			Профиль,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ПрофильОтборВыбран);
	Элементы.Профиль.Видимость = Не ПрофильОтборВыбран;
	 
КонецПроцедуры

#КонецОбласти