//
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ПрограммныйИнтерфейс

#Область ПерсональнаяАвторизация

// Получить токен.
// 
// Параметры:
//  Client_id - Строка - Client id
//  Client_secret - Строка -  Client secret
// 
// ----------------------------------------
// Для работы с API от своего лица необходимо получить токен авторизации - отдельный для каждой учетной записи на Авито.
//
//Получаем client_id и client_secret в личном кабинете
//
//Выписываем себе токен:
//
//curl -i 'https://api.avito.ru/token/?grant_type=client_credentials&client_id=<CLIENT_ID>&client_secret=<CLIENT_SECRET>'
//Далее выполняем запросы к API с заголовком Authorization: Bearer <ACCESS_TOKEN>
//
//Время действия токена ограничено - 1 час с момента его получения. После этого вам необходимо получить новый токен.
// ----------------------------------------
// 
// Возвращаемое значение:
//  Строка, Неопределено - Токен
Функция ПолучитьТокен(Client_id, Client_secret) Экспорт

	ПолучитьТокен = Неопределено;

	ШаблонТекстаЗапроса = "%1/token/?grant_type=client_credentials&client_id=%2&client_secret=%3";
	КлючТокена = КлючТокена();

	// Формирование текста запроса	
	ТекстЗапроса = СтрШаблон(ШаблонТекстаЗапроса, АдресСайта(), Client_id, Client_secret);

	// Выполнение запроса
	ОтветСайта = МП_ИнтернетКлиентСервер.ОтправитьGETЗапрос(ТекстЗапроса);

	// Расшифровка результата выполнения запроса
	Если ОтветСайта.КодСостояния = 200
		 И ТипЗнч(ОтветСайта.ТелоОтвета) = Тип("Структура")
		 И ОтветСайта.ТелоОтвета.Свойство(КлючТокена) Тогда
		ПолучитьТокен = ОтветСайта.ТелоОтвета[КлючТокена];
	КонецЕсли;

	Возврат ПолучитьТокен;

КонецФункции

#КонецОбласти

#Область Пользователь
// Методы API для получения информации о пользователе Авито

// Получить информацию об авторизованном пользователе.
// 
// Параметры:
//  Токен - Строка - Токен
// 
// Возвращаемое значение:
//  Неопределено, Структура -- Получить информацию об авторизованном пользователе::
// * НомерПрофиля - Строка
Функция ПолучитьИнформациюОбАвторизованномПользователе(Токен) Экспорт

	РезультатЗапроса = Неопределено;

	ШаблонТекстаЗапроса = "%1/core/v1/accounts/self";
	Заголовки = ЗаголовокАвторизации(Токен);

	// Формирование текста запроса	
	ТекстЗапроса = СтрШаблон(ШаблонТекстаЗапроса, АдресСайта());

	// Выполнение запроса
	ОтветСайта = МП_ИнтернетКлиентСервер.ОтправитьGETЗапрос(ТекстЗапроса, Заголовки);

	// Расшифровка результата выполнения запроса
	Если ОтветСайта.КодСостояния = 200 И ТипЗнч(ОтветСайта.ТелоОтвета) = Тип("Структура") Тогда

		ТелоОтвета = ОтветСайта.ТелоОтвета;

		РезультатЗапроса = Новый Структура;
		РезультатЗапроса.Вставить("ИмяКлиента", ТелоОтвета.name);
		РезультатЗапроса.Вставить("НомерПрофиля", ТелоОтвета.id);
		РезультатЗапроса.Вставить("ОсновнойНомерТелефона", ТелоОтвета.phone);
		РезультатЗапроса.Вставить("ЭлектроннаяПочта", ТелоОтвета.email);
		РезультатЗапроса.Вставить("СсылкаНаПрофиль", ТелоОтвета.profile_url);

	КонецЕсли;

	Возврат РезультатЗапроса;

КонецФункции

#КонецОбласти

#Область СервисАвтозагрузка
// Методы API для получения информации об автозагрузке объявлений

// Получить данные последнего актуального отчета.
// 
// Параметры:
//  Токен - Строка - Токен
//  ИдентификаторПользователя - Строка - Идентификатор пользователя
// 
// Возвращаемое значение:
//  Структура, Неопределено - Получить данные последнего актуального отчета:
// * СписокОбъявлений - Массив -
Функция ПолучитьДанныеПоследнегоАктуальногоОтчета(Токен, ИдентификаторПользователя) Экспорт

	ШаблонТекстаЗапроса = "%1/autoload/v1/accounts/%2/reports/last_report/";

	РезультатЗапроса = Неопределено;

	Заголовки = ЗаголовокАвторизации(Токен);

	// Формирование текста запроса	
	ТекстЗапроса = СтрШаблон(ШаблонТекстаЗапроса, АдресСайта(), Формат(ИдентификаторПользователя, "ЧГ=0;"));

	// Выполнение запроса
	НомерПопытки = 1;
	ОтветСайта = Неопределено;

	Пока НомерПопытки < 10 И ОтветСайта = Неопределено Цикл
		ОтветСайта = МП_ИнтернетКлиентСервер.ОтправитьGETЗапрос(ТекстЗапроса, Заголовки);
		НомерПопытки = НомерПопытки + 1;
	КонецЦикла;

	// Расшифровка результата выполнения запроса
	Если ОтветСайтаОк(ОтветСайта) Тогда

		ТелоОтвета = ОтветСайта.ТелоОтвета;

		ДанныеЗагрузки = Новый Структура;
		ДанныеЗагрузки.Вставить("НомерОтчета", ТелоОтвета.report.id);
		ДанныеЗагрузки.Вставить("ВремяОкончанияВыгрузкиОбъявленийНаСайт",
								ПрочитатьДатуJSON(ТелоОтвета.report.finished_at, ФорматДатыJSON.ISO));
		ДанныеЗагрузки.Вставить("ВремяСозданияОтчета", ПрочитатьДатуJSON(ТелоОтвета.report.started_at,
																		 ФорматДатыJSON.ISO));
		ДанныеЗагрузки.Вставить("НазваниеОрганизации", ТелоОтвета.report.customer_name);
		ДанныеЗагрузки.Вставить("ВремяГенерацииДанногоОтчета", ПрочитатьДатуJSON(ТелоОтвета.report.generated_at,
																				 ФорматДатыJSON.ISO));
		ДанныеЗагрузки.Вставить("ОбщийСтатусВыгрузки", ТелоОтвета.report.status);
		ДанныеЗагрузки.Вставить("ВерсияФорматаОтчета", ТелоОтвета.report.version);

		СписокОбъявлений = Новый Массив;

		Для Каждого Элемент Из ТелоОтвета.report.ads Цикл

			Объявление = Новый Структура;

			Если Элемент.Свойство("ad_id") Тогда
				Объявление.Вставить("Идентификатор", Элемент.ad_id);
			КонецЕсли;

			Если Элемент.Свойство("avito_date_end") И Не ПустаяСтрока(Элемент.avito_date_end) Тогда
				Объявление.Вставить("ДатаОкончания", ПрочитатьДатуJSON(Элемент.avito_date_end, ФорматДатыJSON.ISO));
			КонецЕсли;

			Если Элемент.Свойство("avito_id") Тогда
				Попытка
					ИдентификаторАвито = Число(Элемент.avito_id);
				Исключение
					ИдентификаторАвито = 0;
				КонецПопытки;
				Объявление.Вставить("ИдентификаторАвито", ИдентификаторАвито);
			КонецЕсли;

			Если Элемент.Свойство("url") Тогда
				Объявление.Вставить("URLАдресОбъявления", Элемент.url);
			КонецЕсли;

			Объявление.Вставить("СтатусРазмещенияНаСайте", Элемент.statuses.avito.help);
			Объявление.Вставить("ОбщийСтатусОбработкиОбъявления", Элемент.statuses.general.help);
			Объявление.Вставить("СтатусПредварительнойОбработки", Элемент.statuses.processing.help);

			// Добавление объявления в массив объявлений
			СписокОбъявлений.Добавить(Объявление);

		КонецЦикла;

		РезультатЗапроса = Новый Структура;
		РезультатЗапроса.Вставить("ДанныеОтчета", ДанныеЗагрузки);
		РезультатЗапроса.Вставить("СписокОбъявлений", СписокОбъявлений);

	Иначе
		РезультатЗапроса = Неопределено;
	КонецЕсли;

	Возврат РезультатЗапроса;

КонецФункции
#КонецОбласти

#Область Объявления
// Общие методы API для работы с объявлениями на Авито

Функция ПолучениеИнформацииПоОбъявлениям(Токен, ОбъявленийНаСтраницу = 0, НомерСтраницы = 0) Экспорт

	ШаблонТекстаЗапроса = "%1/core/v1/items?per_page=%2&page=%3";

	РезультатЗапроса = Новый Массив;

	Заголовки = ЗаголовокАвторизации(Токен);

	// Формирование текста запроса	
	АдресСайта = АдресСайта();
	ОбъявленийНаСтраницу = ?(ОбъявленийНаСтраницу = 0, 99, ОбъявленийНаСтраницу);

	// Выполнение цикла запросов
	Страница = ?(НомерСтраницы > 0, НомерСтраницы, 1);
	Пока Страница > 0 Цикл

		ТекстЗапроса = СтрШаблон(ШаблонТекстаЗапроса, АдресСайта, ОбъявленийНаСтраницу, Страница);

		ОтветСайта = МП_ИнтернетКлиентСервер.ОтправитьGETЗапрос(ТекстЗапроса, Заголовки);

		Если ОтветСайта <> Неопределено
			 И ОтветСайта.КодСостояния = 200
			 И ТипЗнч(ОтветСайта.ТелоОтвета) = Тип("Структура") Тогда

			ТелоОтвета = ОтветСайта.ТелоОтвета;
			НаборОбъявлений = ТелоОтвета.resources;

			Если НаборОбъявлений.Количество() = 0 Или НомерСтраницы > 0 Тогда
				Страница = 0;
			Иначе
				Страница = Страница + 1;
			КонецЕсли;

			Для Каждого Элемент Из НаборОбъявлений Цикл

				Объявление = Новый Структура;
				Объявление.Вставить("ИдентификаторАвито", Элемент.id);
				Объявление.Вставить("НазваниеОбъявления", Элемент.title);
				Объявление.Вставить("Цена", Элемент.price);
				Объявление.Вставить("КатегорияОбъявления", Элемент.category.name);
				Объявление.Вставить("СтатусОбъявления", Элемент.status);
				Объявление.Вставить("URLАдресОбъявления", Элемент.url);

				РезультатЗапроса.Добавить(Объявление);

			КонецЦикла;

		КонецЕсли;

	КонецЦикла;

	Возврат РезультатЗапроса;

КонецФункции

// Возвращает данные об объявлении - его статус, список примененных услуг
// 
// Параметры:
//  Токен - Строка - Токен
//  ИдентификаторАвито - Число - Идентификатор объявления на сайте
//  ИдентификаторПользователя - Число - Номер пользователя в Личном кабинете Авито
// 
// Возвращаемое значение:
//  Неопределено -- Получение информации по объявлению
Функция ПолучениеИнформацииПоОбъявлению(Токен, ИдентификаторАвито, ИдентификаторПользователя) Экспорт

	ШаблонТекстаЗапроса = "%1/core/v1/accounts/%2/items/%3";

	РезультатЗапроса = Неопределено;

	Заголовки = ЗаголовокАвторизации(Токен);

	// Формирование текста запроса	
	ТекстЗапроса = СтрШаблон(ШаблонТекстаЗапроса,
							 АдресСайта(),
							 Формат(ИдентификаторПользователя, "ЧГ=0;"),
							 Формат(ИдентификаторАвито, "ЧГ=0;"));

	ОтветСайта = МП_ИнтернетКлиентСервер.ОтправитьGETЗапрос(ТекстЗапроса, Заголовки);

	Если ОтветСайта <> Неопределено И ОтветСайта.КодСостояния = 200 И ТипЗнч(ОтветСайта.ТелоОтвета) = Тип("Структура") Тогда

		ТелоОтвета = ОтветСайта.ТелоОтвета;

		РезультатЗапроса = Новый Структура;

		РезультатЗапроса.Вставить("СтатусОбъявления", ТелоОтвета.status);
		РезультатЗапроса.Вставить("ДатаНачала", ПрочитатьДатуJSON(ТелоОтвета.start_time, ФорматДатыJSON.ISO));
		РезультатЗапроса.Вставить("ДатаОкончания", ПрочитатьДатуJSON(ТелоОтвета.finish_time, ФорматДатыJSON.ISO));
//		РезультатЗапроса.Вставить("СтатусОбъявления", ТелоОтвета.vas);
		РезультатЗапроса.Вставить("URLАдресОбъявления", ТелоОтвета.url);
		РезультатЗапроса.Вставить("ИдентификаторАвтозагрузки", ТелоОтвета.autoload_item_id);

	КонецЕсли;

	Возврат РезультатЗапроса;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Проверка ответа сайта на соответствие коду 200
// 
// Параметры:
//  ОтветСайта - Структура, Неопределено - Ответ сайта:
// * КодСостояния - Число - Код состояния
// * ТелоОтвета - Произвольный - Тело ответа
// 
// Возвращаемое значение:
//  Булево - Сайт вернул "200"
Функция ОтветСайтаОк(ОтветСайта)
	Возврат ОтветСайта <> Неопределено
			И ОтветСайта.КодСостояния = 200
			И ТипЗнч(ОтветСайта.ТелоОтвета) = Тип("Структура");
КонецФункции

// Возвращает URI API Авито
// 
// Возвращаемое значение:
//  Строка - Адрес сайта
Функция АдресСайта() Экспорт
	Возврат "https://api.avito.ru";
КонецФункции

// Возвращает ключ токена
// 
// Возвращаемое значение:
//  Строка - Ключ токена
Функция КлючТокена() Экспорт
	Возврат "access_token";
КонецФункции

// Возвращает заголовок авторизации на основе токена
// 
// Параметры:
//  Токен - Строка - Токен
//  Заголовки - Неопределено, Соответствие - Заголовки запроса
// 
// Возвращаемое значение:
//  Соответствие - Заголовок авторизации
Функция ЗаголовокАвторизации(Токен, Заголовки = Неопределено) Экспорт

	ЗаголовокAuthorization = "Authorization";
	ЗаголовокAuthorizationШаблон = "Bearer %1";

	// Если не указан параметр Заголовки - создаем новое соответствие для заголовков, если указан - добавляем 
	// к существующему
	Если Заголовки = Неопределено Тогда
		Заголовки = Новый Соответствие;
	КонецЕсли;

	Заголовки.Вставить(ЗаголовокAuthorization, СтрШаблон(ЗаголовокAuthorizationШаблон, Токен));

	Возврат Заголовки

КонецФункции

#КонецОбласти