//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Реквизиты() Экспорт

	НаборРеквизитов = Новый Массив;
	КоллекцияКлассов = Новый Массив;

	МетаданныеРегистра = Метаданные.РегистрыСведений.АС2_ЗагрузкаРесурсов;

	КоллекцияКлассов.Добавить(МетаданныеРегистра.Измерения);
	КоллекцияКлассов.Добавить(МетаданныеРегистра.Ресурсы);
	КоллекцияКлассов.Добавить(МетаданныеРегистра.Реквизиты);
	КоллекцияКлассов.Добавить(МетаданныеРегистра.СтандартныеРеквизиты);

	Для Каждого Раздел Из КоллекцияКлассов Цикл
		Для Каждого Реквизит Из Раздел Цикл
			НаборРеквизитов.Добавить(Реквизит.Имя);
		КонецЦикла;
	КонецЦикла;

	СписокРеквизитов = СтрСоединить(НаборРеквизитов, ",");

	Возврат Новый Структура(СписокРеквизитов);

КонецФункции

#КонецОбласти

#КонецЕсли