//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращаает массив ссылок на элементы с заполненными реквизитами:
// - Client_id
// - Client_secret
// - URLЗагрузки
// - ИмяФайлаВыгрузки
// 
// Возвращаемое значение:
//  СписокЗначений -- Готовы к автозагрузке
Функция ГотовыКАвтозагрузке() Экспорт

	ГотовыКАвтозагрузке = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	МП_Профили.Ссылка КАК Ссылка,
				   |	КОЛИЧЕСТВО(МП_ПрофилиСегментыНоменклатуры.Сегмент) КАК КоличествоСегментов
				   |ПОМЕСТИТЬ ВТПрофили
				   |ИЗ
				   |	Справочник.МП_Профили КАК МП_Профили
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МП_Профили.СегментыНоменклатуры КАК МП_ПрофилиСегментыНоменклатуры
				   |		ПО МП_ПрофилиСегментыНоменклатуры.Ссылка = МП_Профили.Ссылка
				   |ГДЕ
				   |	МП_Профили.URLЗагрузки <> """"
				   |	И МП_Профили.ИмяФайлаВыгрузки <> """"
				   |	И МП_ПрофилиСегментыНоменклатуры.Сегмент <> ЗНАЧЕНИЕ(Справочник.МП_Профили.ПустаяСсылка)
				   |	И МП_ПрофилиСегментыНоменклатуры.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
				   |СГРУППИРОВАТЬ ПО
				   |	МП_Профили.Ссылка
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТПрофили.Ссылка
				   |ИЗ
				   |	ВТПрофили КАК ВТПрофили
				   |ГДЕ
				   |	ВТПрофили.КоличествоСегментов > 0
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	ВТПрофили.Ссылка.ВидМаркетплейса";

	ЭлементыСправочника = Запрос.Выполнить().Выбрать();

	Пока ЭлементыСправочника.Следующий() Цикл
		ГотовыКАвтозагрузке.Добавить(ЭлементыСправочника.Ссылка);
	КонецЦикла;

	Возврат ГотовыКАвтозагрузке;

КонецФункции

// Возвращает данные для формирования объявлений
// 
// Параметры:
//  Ссылка - СправочникСсылка.МП_Профили - Профиль выгрузки объявлений
// 
// Возвращаемое значение:
//  Структура - Товары профиля:
// * Товары - ВыборкаИзРезультатаЗапроса -
// * Остатки - ВыборкаИзРезультатаЗапроса -
// * Картинки - ВыборкаИзРезультатаЗапроса -
// * Свойства - ВыборкаИзРезультатаЗапроса -
// * Модели - ВыборкаИзРезультатаЗапроса -
Функция ТоварыПрофиля(Ссылка) Экспорт

	СвойствоЮла = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Юла", Истина);

	ВидМаркетплейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ВидМаркетплейса");

	КоллекцияСвойств = МП_ДопРеквизитыВызовСервераПовтИсп.ПубликуемыеДопРеквизиты();

	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("КоллекцияСвойств", КоллекцияСвойств);
	Запрос.УстановитьПараметр("СвойствоЮла", СвойствоЮла);

	ТекстЗапроса = "ВЫБРАТЬ
				   |	МП_ПрофилиСегментыНоменклатуры.Сегмент КАК Сегмент,
				   |	МП_ПрофилиСегментыНоменклатуры.НомерСтроки КАК Приоритет,
				   |	МП_ПрофилиСегментыНоменклатуры.ВидЦены КАК ВидЦены,
				   |	МП_ПрофилиСегментыНоменклатуры.Скидка КАК Скидка,
				   |	МП_ПрофилиСегментыНоменклатуры.ВариантПлатногоРазмещения КАК ВариантПлатногоРазмещения,
				   |	МП_ПрофилиСегментыНоменклатуры.ПлатнаяУслуга КАК ПлатнаяУслуга,
				   |	МП_ПрофилиСегментыНоменклатуры.Состояние КАК Состояние
				   |ПОМЕСТИТЬ ВТСегментыПодробно
				   |ИЗ
				   |	Справочник.МП_Профили.СегментыНоменклатуры КАК МП_ПрофилиСегментыНоменклатуры
				   |ГДЕ
				   |	МП_ПрофилиСегментыНоменклатуры.Ссылка = &Ссылка
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ДополнительныеСведения.Объект КАК Ссылка,
				   |	ВЫБОР
				   |		КОГДА МП_ЮлаКатегории.Ссылка = ЗНАЧЕНИЕ(Справочник.МП_ЮлаКатегории.ПустаяСсылка)
				   |			ТОГДА """"
				   |		ИНАЧЕ МП_ЮлаКатегории.Код
				   |	КОНЕЦ КАК ЮлаКатегория,
				   |	ВЫБОР
				   |		КОГДА МП_ЮлаПодкатегории.Ссылка = ЗНАЧЕНИЕ(Справочник.МП_ЮлаПодкатегории.ПустаяСсылка)
				   |			ТОГДА """"
				   |		ИНАЧЕ МП_ЮлаПодкатегории.Код
				   |	КОНЕЦ КАК ЮлаПодкатегория,
				   |	ВЫБОР
				   |		КОГДА МП_ЮлаТипыДеталей.Ссылка = ЗНАЧЕНИЕ(Справочник.МП_ЮлаТипыДеталей.ПустаяСсылка)
				   |			ТОГДА """"
				   |		ИНАЧЕ МП_ЮлаТипыДеталей.Код
				   |	КОНЕЦ КАК ЮлаТипДетали,
				   |	ВЫБОР
				   |		КОГДА МП_ЮлаГруппыДеталей.Ссылка = ЗНАЧЕНИЕ(Справочник.МП_ЮлаГруппыДеталей.ПустаяСсылка)
				   |			ТОГДА """"
				   |		ИНАЧЕ МП_ЮлаГруппыДеталей.Код
				   |	КОНЕЦ КАК ЮлаГруппаДеталей,
				   |	ВЫБОР
				   |		КОГДА МП_ЮлаНазванияДеталей.Ссылка = ЗНАЧЕНИЕ(Справочник.МП_ЮлаНазванияДеталей.ПустаяСсылка)
				   |			ТОГДА """"
				   |		ИНАЧЕ МП_ЮлаНазванияДеталей.Код
				   |	КОНЕЦ КАК ЮлаНазваниеДетали,
				   |	МП_ЮлаПодкатегории.Тег КАК ЮлаТегПодкатегории
				   |ПОМЕСТИТЬ ВТТоварныеКатегории
				   |ИЗ
				   |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МП_ЮлаРазмещенияОбъявлений КАК МП_ЮлаРазмещенияОбъявлений
				   |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МП_ЮлаКатегории КАК МП_ЮлаКатегории
				   |			ПО МП_ЮлаРазмещенияОбъявлений.Категория = МП_ЮлаКатегории.Ссылка
				   |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МП_ЮлаПодкатегории КАК МП_ЮлаПодкатегории
				   |			ПО МП_ЮлаРазмещенияОбъявлений.Подкатегория = МП_ЮлаПодкатегории.Ссылка
				   |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МП_ЮлаТипыДеталей КАК МП_ЮлаТипыДеталей
				   |			ПО МП_ЮлаРазмещенияОбъявлений.ТипДетали = МП_ЮлаТипыДеталей.Ссылка
				   |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МП_ЮлаГруппыДеталей КАК МП_ЮлаГруппыДеталей
				   |			ПО МП_ЮлаРазмещенияОбъявлений.ГруппаДеталей = МП_ЮлаГруппыДеталей.Ссылка
				   |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МП_ЮлаНазванияДеталей КАК МП_ЮлаНазванияДеталей
				   |			ПО МП_ЮлаРазмещенияОбъявлений.НазваниеДетали = МП_ЮлаНазванияДеталей.Ссылка
				   |		ПО МП_ЮлаРазмещенияОбъявлений.Наименование = ДополнительныеСведения.Значение
				   |ГДЕ
				   |	ДополнительныеСведения.Свойство = &СвойствоЮла
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	НоменклатураСегмента.Номенклатура КАК Номенклатура,
				   |	НоменклатураСегмента.Характеристика КАК Характеристика,
				   |	НоменклатураСегмента.Номенклатура.ТоварнаяКатегория КАК ТоварнаяКатегория,
				   |	МАКСИМУМ(ВТСегментыПодробно.Приоритет) КАК Приоритет
				   |ПОМЕСТИТЬ ВТНоменклатура
				   |ИЗ
				   |	ВТСегментыПодробно КАК ВТСегментыПодробно
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
				   |		ПО ВТСегментыПодробно.Сегмент = НоменклатураСегмента.Сегмент
				   |СГРУППИРОВАТЬ ПО
				   |	НоменклатураСегмента.Номенклатура,
				   |	НоменклатураСегмента.Характеристика,
				   |	НоменклатураСегмента.Номенклатура.ТоварнаяКатегория
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	Номенклатура,
				   |	Характеристика
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТНоменклатура.Номенклатура КАК Номенклатура,
				   |	ВТНоменклатура.Характеристика КАК Характеристика,
				   |	ВТСегментыПодробно.Сегмент КАК Сегмент,
				   |	ВТСегментыПодробно.ВидЦены КАК ВидЦены,
				   |	ВТСегментыПодробно.Скидка КАК Скидка,
				   |	ВТНоменклатура.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
				   |	ВТСегментыПодробно.ВариантПлатногоРазмещения КАК ВариантПлатногоРазмещения,
				   |	ВТСегментыПодробно.ПлатнаяУслуга КАК ПлатнаяУслуга,
				   |	ВТСегментыПодробно.Состояние КАК Состояние,
				   |	ВТНоменклатура.ТоварнаяКатегория КАК ТоварнаяКатегория,
				   |	ЕСТЬNULL(ВТТоварныеКатегории.ЮлаКатегория, """") КАК ЮлаКатегория,
				   |	ЕСТЬNULL(ВТТоварныеКатегории.ЮлаПодкатегория, """") КАК ЮлаПодкатегория,
				   |	ЕСТЬNULL(ВТТоварныеКатегории.ЮлаТипДетали, """") КАК ЮлаТипДетали,
				   |	ЕСТЬNULL(ВТТоварныеКатегории.ЮлаГруппаДеталей, """") КАК ЮлаГруппаДеталей,
				   |	ЕСТЬNULL(ВТТоварныеКатегории.ЮлаНазваниеДетали, """") КАК ЮлаНазваниеДетали,
				   |	ЕСТЬNULL(ВТТоварныеКатегории.ЮлаТегПодкатегории, """") КАК ЮлаТегПодкатегории
				   |ПОМЕСТИТЬ ВТТовары
				   |ИЗ
				   |	ВТСегментыПодробно КАК ВТСегментыПодробно
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНоменклатура КАК ВТНоменклатура
				   |			ЛЕВОЕ СОЕДИНЕНИЕ ВТТоварныеКатегории КАК ВТТоварныеКатегории
				   |			ПО ВТТоварныеКатегории.Ссылка = ВТНоменклатура.ТоварнаяКатегория
				   |		ПО ВТНоменклатура.Приоритет = ВТСегментыПодробно.Приоритет
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	Номенклатура,
				   |	Характеристика
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТТовары.Номенклатура КАК Номенклатура,
				   |	ВТТовары.Характеристика КАК Характеристика,
				   |	ВТТовары.Сегмент КАК Сегмент,
				   |	ВТТовары.ВидЦены КАК ВидЦены,
				   |	ЕСТЬNULL(Цены.Цена, 0) КАК Цена,
				   |	ВТТовары.Скидка КАК Скидка,
				   |	ЕСТЬNULL(Цены.Цена * (100 - ВТТовары.Скидка) / 100, 0) КАК ЦенаСоСкидкой,
				   |	ВТТовары.Номенклатура.Описание КАК НоменклатураОписание,
				   |	ВТТовары.Номенклатура.Производитель КАК Производитель,
				   |	ВТТовары.Номенклатура.Артикул КАК Артикул,
				   |	ВТТовары.Номенклатура.Код КАК Код,
				   |	ВТТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
				   |	ВТТовары.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
				   |	ЕСТЬNULL(МП_КатегорииYML.id, 7777) КАК categoryId,
				   |	ВТТовары.ВариантПлатногоРазмещения КАК ВариантПлатногоРазмещения,
				   |	ВТТовары.ПлатнаяУслуга КАК ПлатнаяУслуга,
				   |	ВТТовары.Состояние КАК Состояние,
				   |	ЕСТЬNULL(МП_КатегорииYML.АвитоПодкатегорияТоваров.Код, ""00-000"") КАК TypeidAvito,
				   |	0 КАК Ноль,
				   |	ВТТовары.ЮлаКатегория КАК ЮлаКатегория,
				   |	ВТТовары.ЮлаПодкатегория КАК ЮлаПодкатегория,
				   |	ВТТовары.ЮлаТипДетали КАК ЮлаТипДетали,
				   |	ВТТовары.ЮлаГруппаДеталей КАК ЮлаГруппаДеталей,
				   |	ВТТовары.ЮлаНазваниеДетали КАК ЮлаНазваниеДетали,
				   |	ВТТовары.ЮлаТегПодкатегории КАК ЮлаТегПодкатегории
				   |ИЗ
				   |	ВТТовары КАК ВТТовары
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК Цены
				   |		ПО Цены.Номенклатура = ВТТовары.Номенклатура
				   |		И Цены.Характеристика = ВТТовары.Характеристика
				   |		И Цены.ВидЦены = ВТТовары.ВидЦены
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МП_КатегорииYML КАК МП_КатегорииYML
				   |		ПО МП_КатегорииYML.Категория = ВТТовары.ВидНоменклатуры
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
				   |	РаспределениеЗапасов.Характеристика КАК Характеристика,
				   |	СУММА(ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0)) КАК Свободно,
				   |	РаспределениеЗапасов.Склад КАК Склад,
				   |	""<li><strong>"" + СкладыКонтактнаяИнформация.Ссылка.Наименование + ""</strong> ("" + СкладыКонтактнаяИнформация.Город +
				   |		"")"" КАК СкладAvito
				   |ИЗ
				   |	ВТНоменклатура КАК ВТНоменклатура
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
				   |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформация
				   |			ПО СкладыКонтактнаяИнформация.Ссылка = РаспределениеЗапасов.Склад
				   |		ПО РаспределениеЗапасов.Номенклатура = ВТНоменклатура.Номенклатура
				   |		И РаспределениеЗапасов.Характеристика = ВТНоменклатура.Характеристика
				   |ГДЕ
				   |	РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
				   |СГРУППИРОВАТЬ ПО
				   |	РаспределениеЗапасов.Номенклатура,
				   |	РаспределениеЗапасов.Характеристика,
				   |	РаспределениеЗапасов.Склад,
				   |	""<li><strong>"" + СкладыКонтактнаяИнформация.Ссылка.Наименование + ""</strong> ("" + СкладыКонтактнаяИнформация.Город +
				   |		"")""
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТНоменклатура.Номенклатура КАК Номенклатура,
				   |	ВТНоменклатура.Характеристика КАК Характеристика,
				   |	НоменклатураПрисоединенныеФайлы.ПутьКФайлу КАК ПутьКФайлу
				   |ИЗ
				   |	ВТНоменклатура КАК ВТНоменклатура
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
				   |		ПО НоменклатураПрисоединенныеФайлы.ВладелецФайла = ВТНоменклатура.Номенклатура
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	НоменклатураДополнительныеРеквизиты.Свойство.Заголовок КАК Заголовок,
				   |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение,
				   |	ВТНоменклатура.Номенклатура КАК Номенклатура,
				   |	ВТНоменклатура.Характеристика КАК Характеристика
				   |ИЗ
				   |	ВТНоменклатура КАК ВТНоменклатура
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
				   |		ПО НоменклатураДополнительныеРеквизиты.Ссылка = ВТНоменклатура.Номенклатура
				   |ГДЕ
				   |	НоменклатураДополнительныеРеквизиты.Свойство В (&КоллекцияСвойств)
				   |	И НоменклатураДополнительныеРеквизиты.Значение <> 0
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	КА2_МоделиАвтомобилейДляНоменклатуры.КлючМодели.Представление КАК КлючМодели,
				   |	ВТНоменклатура.Номенклатура КАК Номенклатура,
				   |	ВТНоменклатура.Характеристика КАК Характеристика
				   |ИЗ
				   |	ВТНоменклатура КАК ВТНоменклатура
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КА2_МоделиАвтомобилейДляНоменклатуры КАК КА2_МоделиАвтомобилейДляНоменклатуры
				   |		ПО КА2_МоделиАвтомобилейДляНоменклатуры.Номенклатура = ВТНоменклатура.Номенклатура
				   |ГДЕ
				   |	КА2_МоделиАвтомобилейДляНоменклатуры.Совместимо = ИСТИНА";

	Если ВидМаркетплейса = Перечисления.МП_ВидыМаркетплейсов.ДРОМ Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "0 КАК Ноль", """RUR"" КАК currencyId,
															   |	""Новый"" КАК condition,
															   |	""В наличии"" КАК status");
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;

	УстановитьПривилегированныйРежим(Истина);

	Результат = Запрос.ВыполнитьПакет();

	ТоварыПрофиля = Новый Структура;

	Товары = Результат[4].Выбрать();
	Остатки = Результат[5].Выбрать();
	Картинки = Результат[6].Выбрать();
	Свойства = Результат[7].Выбрать();
	Модели = Результат[8].Выбрать();

	УстановитьПривилегированныйРежим(Ложь);

	ТоварыПрофиля.Вставить("Товары", Товары);
	ТоварыПрофиля.Вставить("Остатки", Остатки);
	ТоварыПрофиля.Вставить("Картинки", Картинки);
	ТоварыПрофиля.Вставить("Свойства", Свойства);
	ТоварыПрофиля.Вставить("Модели", Модели);

	Возврат ТоварыПрофиля;

КонецФункции

// Возвращает массив наименований зон показа
// 
// Параметры:
//  Ссылка - СправочникСсылка.МП_Профили - Ссылка
// 
// Возвращаемое значение:
//  Массив - Зоны показа
Функция ЗоныПоказа(Ссылка) Экспорт

	Перем Запрос;
	Перем НаборЗонПоказа;

	НаборЗон = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
				   |	ЗоныПоказа.НомерСтроки КАК НомерСтроки,
				   |	ЗоныПоказа.ЗонаПоказа.Наименование КАК НаименованиеЗоны
				   |ИЗ
				   |	Справочник.МП_Профили.ЗоныПоказа КАК ЗоныПоказа
				   |ГДЕ
				   |	ЗоныПоказа.Ссылка = &Ссылка
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	НомерСтроки";
	НаборЗонПоказа = Запрос.Выполнить().Выбрать();

	Пока НаборЗонПоказа.Следующий() Цикл
		НаборЗон.Добавить(НаборЗонПоказа.НаименованиеЗоны);
	КонецЦикла;

	Возврат НаборЗон;

КонецФункции

#КонецОбласти

#КонецЕсли