// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Кеширование текста запроса динамического списка
	КешТекстаЗапроса = Список.ТекстЗапроса;
	
	// Отбор только по записям из файлов последней поставки
	ТолькоИзБазыПоставщика = Истина;
	ТолькоИзБазыПоставщикаУстановитьОтбор();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТолькоИзБазыПоставщикаПриИзменении(Элемент)

	ТолькоИзБазыПоставщикаУстановитьОтбор();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТолькоИзБазыПоставщикаУстановитьОтбор()

	Если ТолькоИзБазыПоставщика Тогда
		КешТекстаЗапроса = Список.ТекстЗапроса;
		ЗапросДопОтбор = " И НЕ КА2_Комплектации.ПометкаУдаления И КА2_Комплектации.date_create <> """"";
		Список.ТекстЗапроса = КешТекстаЗапроса + ЗапросДопОтбор;
	Иначе
		Список.ТекстЗапроса = КешТекстаЗапроса;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти